{"title": "Rain-X 830126 Silicone Endura Wiper Blades, 26 Inch Windshield Wipers (Pack of 1), Automotive Replacement Windshield Wiper Blades With Two Times Longer-Lasting Resilient Silicone Rubber Squeegee", "asin": "B0857KDDDN", "brand": "Rain-X", "stars": "4.5", "reviewsCount": "6,780 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61kQ2K9kgpL._AC_SY879_.jpg", "breadCrumbs": ["Automotive", "›", "Replacement Parts", "›", "Windshield Wipers & Washers", "›", "Wipers", "›", "Blades"], "description": "Rain-X Silicone Endura features a precision-engineered silicone rubber squeegee, with a proprietary graphite coating, specially formulated to provide ultimate durability and extreme all-weather performance. The squeegee is proven to last 2X longer than traditional natural rubber squeegees, based on third-party testing. Designed to endure the toughest conditions, the silicone squeegee maintains excellent stability and performance during long-term exposure to harsh climates and environmental elements. It will not dry out and crack in the summer heat or freeze and break in the winter cold and is resistant to the motor oils, fluids, and solvents encountered on the road that cause organic rubbers to deteriorate rapidly. Rain-X Silicone Endura provides superior wipe quality in the most extreme temperatures (tested to -20°F and +194°F) and in all types of severe or inclement weather conditions experienced while driving, such as heat, wind, rain, sleet, snow, and ice. If you need additional help with determining the right wiper blade size for your car, reference our Blade Finder or Amazon's Confirmed Fit program. If you need help with installing your new wiper blades, installation videos can be found by scanning the QR code on the back of your wiper blade’s packaging.", "price": {"value": "26.48", "currency": "$"}, "url": "https://www.amazon.com/Rain-X-830126-Silicone-Endura-26-Inch/dp/B0857KDDDN/ref=sr_1_270?qid=1684811537&s=automotive-intl-ship&sr=1-270"}