{"title": "SAMSUNG SSD T7 Portable External Solid State Drive 1TB, Up to 1050MB/s, USB 3.2 Gen 2, Reliable Storage for Gaming, Students, Professionals, MU-PC1T0T/AM, Gray", "asin": "4.8\n25,035 ratings\n4.8 out of 5 stars", "brand": "1 TB", "stars": "4.8", "reviewsCount": "25,035 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/91YfRIy7kYL._AC_SX450_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Data Storage", "›", "External Solid State Drives"], "description": "The Samsung Portable SSD T7 is the next standard in external storage. With transfer rates up to 9.5x faster than traditional external hard drives and read/ write speeds up to 1050 MB/s, you can move massive files around with unparalleled ease and fluidity. Its sleek, shock-resistant design is uncommonly durable, capable of withstanding drops from up to 6ft, so you can take it on-the-go with complete peace of mind. The T7 is compatible with PC, Mac, Android devices, gaming consoles, and more. Included in the box are USB Type C-to-C and Type C-to-A cables for added convenience. All firmware and components, including Samsung's world-renowned DRAM and NAND, are produced in-house, allowing end-to-end integration for quality you can trust.Performance may vary depending on host configuration. To reach maximum read/write speeds of up to 1,050/1,000 MB/s, respectively, the host device and connection cables must support USB 3.2Gen 2 and the UASP mode must be enabled. Based on internal test results compared to a Samsung external HDD 1TB (HX-MTD10EA). Test system configuration: ASUS Z370 ROG MAXIMUS X APEX (USB 3.2 Gen 2 Type-C), Intel Core i7-8700K CPU 3.70GHz(Coffeelake), OS-Windows 10 RS6. Based on an internal free fall shock test conducted under controlled conditions. For more information on the warranty, please visit www.samsung.com/us/support/warranty/. According to the Samsung internal quality standards for heat management and safety, T7 maintains its outer casing temperature below 118.4o F, except when the ambient temperature is above 118.4 F. Software requires Windows 7 and higher, Mac OS X 10.10 and higher, or Android 5.1 (Lollipop) and higher. Older versions of the Windows, Mac, and Android operating systems may not be supported. Firmware update requires PC or Mac and internet connection. Android app available on Google Play. Compatibility with host devices may vary. Some operating systems may require T7 Touch reformatting. Please find the compatible devices list on Samsung.com/support. T7 Touch is compatible with USB 3.0 and USB 2.0. Source: 2003-Q3 2020 IHS Markit data: NAND suppliers' revenue market share.", "price": {"value": "84.99", "currency": "$"}, "url": "https://www.amazon.com/SAMSUNG-Portable-SSD-1TB-MU-PC1T0T/dp/B0874XN4D8/ref=sr_1_29?qid=1684829529&s=computers-intl-ship&sr=1-29"}