{"title": "Huggies Little Snugglers Baby Diapers, Size 1 (8-14 lbs), 198 Ct, Newborn Diapers", "asin": "Kimberly-Clark Corp.", "brand": "February 21, 2019", "stars": "4.8", "reviewsCount": "42,348 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/815p+EQgvfL._AC_SX425_.jpg", "breadCrumbs": ["Baby Products", "›", "Diapering", "›", "Disposable Diapers"], "description": "Huggies Little Snugglers Newborn Baby Diapers are designed for up to 12 hours of gentle skin protection for your little one. These disposable baby diapers are made with a curved and stretchy fit, delivering all-around comfort for a gentle tummy fit. The GentleAbsorb Liner absorbs wetness on contact, helping keep your baby’s skin clean and healthy. These newborn diapers also have a soft, back pocketed waistband to prevent diaper blowouts and contain the mess. Extra soft materials provide belly comfort and protection during Tummy Time. Little Snugglers also feature a color-changing wetness indicator that lets you know when your baby’s diaper is ready to be changed. They're also hypoallergenic, dermatologist tested and safe for sensitive skin, as well as fragrance free, lotion free, paraben free, and free of elemental chlorine and natural rubber latex. Designed with limited edition Disney Winnie the Pooh graphics that celebrate 100 years of Disney, Little Snugglers Diapers are available in size Preemie (up to 6 lbs), size Newborn (up to 10 lbs), size 1 (8-14 lbs), size 2 (12-18 lbs), size 3 (16-28 lbs), size 4 (22-37 lbs), size 5 (27+ lbs) and size 6 (35+ lbs). Don't get caught without Huggies diapers! Sign up for Subscribe & Save to ensure you always have Little Snugglers on hand. Join Huggies Rewards+ powered by Fetch to get rewarded. Earn points on Huggies diapers and wipes, in addition to thousands of other products to redeem for hundreds of gift cards. Download the Fetch Rewards app to get started today!", "price": {"value": "52.99", "currency": "$"}, "url": "https://www.amazon.com/Huggies-Little-Snugglers-Diapers-Packaging/dp/B07MP6VXRN/ref=sr_1_57?qid=1684817455&s=baby-products-intl-ship&sr=1-57"}