{"title": "eMedia Bass Method v2 - Learn at Home", "asin": "April 6, 2011", "brand": "music, instruments, instrument accessories", "stars": "3.5", "reviewsCount": "28 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81guSgIMBBS._AC_SX466_.jpg", "breadCrumbs": ["Software", "›", "Music", "›", "Instrument Instruction"], "description": "The latest version of our best-selling bass lessons with Interactive Feedback on your playing! Learning is easy with techniques demonstrated in split-screen videos showing multiple angles and close-ups. The over 140 step-by-step full-screen lessons start with the basics, such as tuning the bass, and move on to playing simple bass lines and catchy rhythms with fills and syncopation. They continue on with playing melodies, both tablature and standard music notation, and a chapter on theory covering intervals, scales and triads. Detailed instructions on how to build your own bass line will teach you how to create a bass line for any song you like! New Instant Feedback listens through the computer’s microphone as you play and highlights correctly played notes. Note Tracker even shows you the notes you play in standard music notation, making learning to read music easier than ever! Follow along with the Animated Fretboard as you listen to the recorded audio and variable-speed MIDI tracks. Also includes bass-only and no-bass options so you can perfect your technique as you play along with the band. Learning bass is made fun with many popular songs, including hit songs made famous by the Grateful Dead, Creedence Clearwater Revival, Bob Dylan, Steve Miller and others. Many of the songs in eMedia Bass Method are found in eMedia Guitar Method, so bass and guitar students can jam along with each other as they learn. Also includes an automatic tuner, recorder, guitar chord dictionary and digital metronome to give you everything you need to start playing bass guitar! ATTENTION MAC USERS - Beginning with macOS 10.15 (Catalina), Apple has eliminated the option to run 32-bit apps on the Mac. If you wish to continue using our applications, which currently require 32-bit support, do not upgrade your operating system past Mac OS 10.14 (Mojave). Alternatively, you can retain an older Mac operating system on a separate drive partition. eMedia developers are currently working on software updates to support Catalina and future versions of macOS, but this is a major undertaking. eMedia is currently unable to foresee how long it will take to create these new versions. If you purchased your eMedia software on or after September 7, 2019, upon receiving proof of purchase eMedia Music will provide you with a free upgrade to a macOS 10.15 (Catalina)-compatible version of an eMedia application when it becomes available. All other registered owners of eMedia software will be qualified for discounted upgrades.", "price": {"value": "49.95", "currency": "$"}, "url": "https://www.amazon.com/eMedia-EG07103-Bass-Method-v2/dp/B004TQQWSA/ref=sr_1_177?qid=1685339161&s=software-intl-ship&sr=1-177"}