{"title": "SAMSUNG 870 EVO SATA III SSD 1TB 2.5” Internal Solid State Drive, Upgrade PC or Laptop Memory and Storage for IT Pros, Creators, Everyday Users, MZ-77E1T0B/AM", "asin": "4.8\n29,179 ratings\n4.8 out of 5 stars", "brand": "1 TB Solid State Hard Drive", "stars": "4.8", "reviewsCount": "29,179 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/911ujeCkGfL._AC_SX450_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Data Storage", "›", "Internal Solid State Drives"], "description": "The latest 870 EVO has indisputable performance, reliability and compatibility built upon Samsung's pioneering technology. Enjoy professional-level SSD performance which maximizes the SATA interface limit to 560/530 MB/s sequential speeds*, accelerates write speeds and maintains long-term high performance with a larger variable buffer. Meet the demands of every task — from everyday computing to 8K video processing, with up to 600 TBW** under a 5-year limited warranty.*** 870 EVO has been compatibility tested**** for major host systems and applications, including chipsets, motherboards, NAS, and video recording devices. Simply plug 870 EVO into the standard 2.5” SATA form factor on your desktop PC or laptop and let the renewed migration software takes care of the rest. Make your drive work smoothly with enhanced Samsung Magician 6 software**** that helps you easily manage your drive, keep up with the latest updates, monitor the drive's health and status, or even enhance its performance. *Performance may vary based on SSD’s firmware version and system hardware & configuration. Sequential write performance measurements are based on Intelligent TurboWrite technology. Test system configuration: Intel Core i7-7700K CPU @ 4.20GHz, DDR4 1200MHz 32GB, OS – Windows 10 Pro x64, Chipset: ASUS PRIME Z270-A. All performance data was measured with the SSD as a secondary. **Warrantied TBW (terabytes written) for 870 EVO: 150 TBW for 250GB model, 300 TBW for 500GB model, 600 TBW for 1TB model, 1,200 TBW for 2TB model and 2,400 TBW for 4TB model. ***5-years or TBW, whichever comes first. For more information on the warranty, please find the enclosed warranty statement in the package. ****Compatibility tests conducted with Samsung internal, AMD, MSI, Gigabyte, Synology, QNAP, BlackMagicDesign and ATMOS. *****Source: 2003-2019 IHS Markit data: NAND suppliers' revenue market share.", "price": {"value": "59.99", "currency": "$"}, "url": "https://www.amazon.com/SAMSUNG-Inch-Internal-MZ-77E1T0B-AM/dp/B08QBJ2YMG/ref=sr_1_29?qid=1685333533&s=electronics&sr=1-29"}