{"title": "ARRIS SURFboard SB8200 DOCSIS 3.1 Cable Modem | Approved for Comcast Xfinity, Cox, Charter Spectrum, & more | Two 1 Gbps Ports | 1 Gbps Max Internet Speeds | 4 OFDM Channels | 2 Year Warranty,White", "asin": "4.5\n17,080 ratings\n4.5 out of 5 stars", "brand": "ARRIS", "stars": "4.5", "reviewsCount": "17,080 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/51-jokOHUcL._AC_SY550_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Networking Products", "›", "Modems"], "description": "Our leadership in video and broadband technology and services, combined with our dedication to close collaboration with our customers, allows us to continually stay ahead of the curve and innovate what's next. ARRIS is relentless in our focus to deliver strong results for our customers and our shareholders, and we do so in a forthright and ethical manner. ARRIS delivers a 70-year legacy of innovation. ARRIS invented digital TV & brought wireless internet into the home with the first cable modem gateway. We have a long track record of creating game-changing technology. We’re the same company that the world's leading service providers choose to connect millions of people around the world to the internet - we’re powering the digital world. ARRIS is at the center of a new era of entertainment and communication that unites our vision and technological leadership with our customers’ evolving needs to help transform the way that millions of people around the world connect to the internet and consume content. The ARRIS SURFboard SB8200 DOCSIS 3.1 Cable Modem is designed to bring you superior connectivity, increase your network capability and provide faster streaming and downloading throughout your home. From a trusted brand with over 260 million modems sold and growing.", "price": {"value": "169.00", "currency": "$"}, "url": "https://www.amazon.com/ARRIS-SURFboard-Approved-SB8200-Frustration/dp/B07DY16W2Z/ref=sr_1_26?qid=1684829529&s=computers-intl-ship&sr=1-26"}