{"title": "Dove Body Wash with Pump Deep Moisture For Dry Skin Moisturizing Skin Cleanser with 24hr Renewing MicroMoisture Nourishes The Driest Skin 30.6 oz", "asin": "B00MEDOY2G", "brand": "Unilever", "stars": "4.8", "reviewsCount": "66,693 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71lPw5gA3-L._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Skin Care", "›", "Body", "›", "Cleansers", "›", "Body Washes"], "description": "Transform your skin with Dove Deep Moisture Body Wash. This nourishing body wash, with 24hr Renewing MicroMoisture, gently cleanses and deeply moisturizes the skin, leaving it renewed and healthy-looking for 24 hours. From the No.1 dermatologist recommended body wash brand, this nourishing body wash has a luxurious lather you’ll love to use in the shower after a long day. Dove Deep Moisture Body Wash has been developed with millions of MicroMoisture droplets and plant-based moisturizers, creating a formula that works to gently cleanse and deeply moisturize skin and nourish your microbiome – skin’s living protective layer. Dove Deep Moisture Body Wash for dry skin actively regenerates skin’s natural moisture and deeply nourishes the driest skin, leaving it soft and hydrated. As a specially designed body wash for soft skin, your skin will feel as soft as it looks. This moisturizing body wash also has a 98% biodegradable formula*. *98% of ingredients break down into carbon dioxide, water and minerals (OECD test methods 301, 302 and/or 310). This gentle skin cleanser is packaged in 100% recycled plastic bottles, vegan, and Dove is PETA approved, meaning we do not test on animals, anywhere in the world, so you can feel good about switching to Dove. How to use: To transform your dry skin with this nourishing body wash, squeeze a generous amount of Dove Deep Moisture Body Wash into your palms. Massage the hydrating body wash onto your skin, taking a moment to enjoy the rich lather and indulgent fragrance, before rinsing off to reveal soft, smooth, and hydrated skin. Dove care goes further than moisturizing skin care with 100% recycled plastic bottles and, globally, Dove is PETA approved. At Dove, our vision is of a world where beauty is a source of confidence, and not anxiety. So, we are on a mission to help the next generation of women develop a positive relationship with the way they look—reaching over ¼ of a billion young people with self-esteem education by 2030.", "price": {"value": "8.97", "currency": "$"}, "url": "https://www.amazon.com/Dove-Body-Wash-Pump-Moisture/dp/B00MEDOY2G/ref=sr_1_4?qid=1684824080&s=beauty-intl-ship&sr=1-4"}