{"title": "Gorilla Waterproof Patch & Seal Tape 4\" x 10' White, (Pack of 1)", "asin": "B08126M2R4", "brand": "Gorilla", "stars": "4.4", "reviewsCount": "17,172 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81QZVnYlZ9L.__AC_SX300_SY300_QL70_FMwebp_.jpg", "breadCrumbs": ["Industrial & Scientific", "›", "Adhesives, Sealants & Lubricants", "›", "Adhesive Tapes", "›", "Duct Tape"], "description": "Gorilla Waterproof Patch & Seal Tape instantly seals out water, air and moisture. With an extra thick adhesive layer and UV resistant backing, this flexible tape conforms to form a permanent bond indoors and out. At 4 inches wide use it to patch holes, cracks, gaps and tears, even underwater. Excellent for Home, auto, marine, camping, RVs, outdoors and more. Will work on plastic, metal, aluminum, rubber, wood, vinyl, glass, steel, acrylic and much more. Gorilla Waterproof Patch & Seal Tape can be applied in hot, cold, wet and dry conditions. For best results, apply the tape to a clean surface at room temperature: 1. Keeping liner on the tape, cut tape to desired size. Tape size should be larger than the repair area, extending beyond all edges. 2. Remove the release liner and place tape over the desired repair area. The tape cannot be repositioned once applied. 3. Rub entire surface of the tape aggressively, especially the edges. Storage: Store tape on the top and bottom disc at room temperature. Edges of tape may be sticky. Service Temp: -70°F to 200°F. Performance will be dependent on surfaces & conditions. Surfaces must be clean, smooth and non-porous. Water must be pressed out from underneath tape. Not for use on seams, applications under pressure, or automotive applications under the hood. May not adhere to silicone or water-repellent materials. Do not use to hang. Permanent: may damage surface or paint if removed. Click on the Gorilla Link at the top of this page to visit the Gorilla Brand Store.", "price": {"value": "11.94", "currency": "$"}, "url": "https://www.amazon.com/Gorilla-Waterproof-Patch-Seal-White/dp/B08126M2R4/ref=sr_1_13?qid=1684811422&s=automotive-intl-ship&sr=1-13"}