{"title": "Waterpik Aquarius Water Flosser Professional For Teeth, Gums, Braces, Dental Care, Electric Power With 10 Settings, 7 Tips For Multiple Users And Needs, ADA Accepted, White WP-660", "asin": "Water Pik, Inc.", "brand": "056310179752", "stars": "4.6", "reviewsCount": "122,194 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/719pUQCxnmL._SY355_.jpg", "breadCrumbs": ["Health & Household", "›", "Oral Care", "›", "Dental Floss & Picks", "›", "Power Dental Flossers"], "description": "ESSENTIAL FOR GOOD ORAL HEALTH\nThe easy and more effective way to floss, the Waterpik Aquarius Water Flosser features advanced technology and a compact, contemporary design. And it is the first dental water flosser in its class accepted by the American Dental Association (ADA). It cleans deep between teeth and below the gum line where traditional brushing and flossing can't reach, using a unique combination of water pressure and pulsations.\n\nCLINICALLY PROVEN\nRemoves up to 99.9 percent of plaque\nUp to 50 percent more effective for improving gum health vs. string floss\n\n\nFEATURES & IN THE BOX\n7 color coded flossing tips for multiple family members and needs\nAdvanced pressure control with 10 settings (10 to 100 PSI) for a custom clean\nReservoir holds 22 ounces of water for 90 seconds of flossing time\nCan be used with your favorite mouthwash\nOn/Off water control on handle\n2 Modes Floss and Hydro Pulse Massage\n1 minute timer with 30 second pacer\nLED information panel\nMeasures 4.7w x 3.8d x 10.35h (inches, with tip)\n\nVOLTAGE\nCompatible with 120VAC/60Hz outlets, for use in North America Only\n\nPRODUCT WARRANTY & SUPPORT\nThe Waterpik support team based in Fort Collins, Colorado is available to help with any product questions or needs. Aquarius is backed by a 3 year limited manufacturer's warranty (see manual for details).\nNote: This is our professional series line of products which contain premium features and function to our base line of products.", "price": {"value": "99.99", "currency": "$"}, "url": "https://www.amazon.com/Waterpik-Flosser-Electric-Countertop-Irrigator/dp/B00HFQQ0VU/ref=sr_1_51?qid=1684824104&s=beauty-intl-ship&sr=1-51"}