{"title": "eMedia Interactive Rock Guitar - Power Chords, Guitar Riffs, Rhythm Guitar, and Lead Guitar", "asin": "B005PODUAS", "brand": "eMedia", "stars": "3.2", "reviewsCount": "31 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81GKGMwQhCS._AC_SX466_.jpg", "breadCrumbs": ["Software", "›", "Music", "›", "Instrument Instruction"], "description": "eMedia Interactive Rock Guitar makes learning guitar easy with over 100 rock guitar lessons. Excellent for the beginner, eMedia’s revolutionary teaching style using audio, video, and interactivity will have you playing songs, chords and riffs, and reading guitar tab within minutes. Learn modern and classic rock, punk, grunge, and metal styles using great rock songs Charles McCrone, graduate of the Guitar Institute of Technology at Musician’s Institute (the legendary training ground for many great rock guitarists), takes you through a complete overview of rock techniques and gear. Learn movable power chords, barre chords, effects pedals, hammer-ons, pull-offs, palm muting, classic riffs, the blues scale, using feedback, the whammy bar, and more! Interactive Feedback technology highlights correctly played notes, making learning faster and easier. The Animated Fretboard displays fingerings, riffs, bends, and rock guitar tricks which are hard to see using only videos. Interactive tabs highlight where you are in a song, let you loop sections, and slow them down to help you master the lessons and songs. SYSTEM REQUIREMENTS: Windows XP/Vista/7/8/10 (32- or 64-bit) or macOS 10.5 to 10.14 (32-bit only). This software does not run on macOS 10.15 or later. Mac users who purchase this item brand new on or after Sept. 7, 2019 are eligible for a free upgrade to a 64-bit compatible version should it become available.", "price": {"value": "33.43", "currency": "$"}, "url": "https://www.amazon.com/eMedia-EG06111-Interactive-Rock-Guitar/dp/B005PODUAS/ref=sr_1_180?qid=1685339161&s=software-intl-ship&sr=1-180"}