{"title": "Rapid TAC Application Fluid for Vinyl Wraps Decals Stickers 4oz Sprayer", "asin": "B006RMC8J6", "brand": "RapidTac", "stars": "4.4", "reviewsCount": "6,116 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61R19J4w8oL._AC_SY879_.jpg", "breadCrumbs": ["Automotive", "›", "Exterior Accessories", "›", "Bumper Stickers, Decals & Magnets", "›", "Decals"], "description": "RAPID TAC Application fluid for Vinyl Wraps Decals Stickers 4oz Sprayer For fast, easy, quality installation of vinyl graphics with no bubbles. Rapid Tac Application Fluid shocked installers by allowing them more control over their applications than ever before. Now what took hours could be accomplished in minutes. Using Rapid Tac Application fluid can often allow a large graphic to be installed with one person where two people were required to perform the same installation dry. Rapid Tac Application Fluid also cleans the substrate without leaving residues ensuring a contaminant free installation. It then helps to \"float\" the vinyl film until it is properly positioned. Rapid Tac Application Fluid's best feature is that it effectively breaks the surface tension of the adhesive on the film allowing it to flow and bond to the substrate more effectively than even a dry application. It is now possible to achieve a full bond in as little as ninety seconds. Your customers and your reputation will benefit from higher-quality applications. Your bottom line will benefit from faster applications and less failures as well. STEP 1. Clean surface thoroughly with Rapid Tac and a kitchen paper towel. DO NOT USE OTHER CLEANERS OR SOLVENTS. (We do recommend Rapid Prep as a pre-cleaner for surfaces that may have been exposed to wax, silicone, or other suspected contaminants) STEP 2. Spray surface again with Rapid Tac, peel backing off decal and place on wet surface. STEP 3. Position decal and spray top of decal to minimize scratching. Use squeegee to remove fluid, using a good deal of pressure and working from the center out to the edges in all directions. WARNING: This product can expose you to chemicals which is [are] known to the State of California to cause cancer and birth defects or other reproductive harm. For more information go to www. P65Warnings. ca. gov.", "price": {"value": "9.99", "currency": "$"}, "url": "https://www.amazon.com/RAPID-Application-Decals-Stickers-Sprayer/dp/B006RMC8J6/ref=sr_1_297?qid=1684811547&s=automotive-intl-ship&sr=1-297"}