{"title": "Brother Genuine High Yield Toner Cartridge, TN660, Replacement Black Toner, Page Yield Up to 2,600 Pages, Amazon Dash Replenishment Cartridge", "asin": "B00LJO8EQS", "brand": "Brother", "stars": "4.7", "reviewsCount": "17,085 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71xkxHWNTIL._SX425_.jpg", "breadCrumbs": ["Office Products", "›", "Office Electronics", "›", "Printers & Accessories", "›", "Printer Parts & Accessories", "›", "Printer Ink & Toner", "›", "Toner Cartridges"], "description": "The use of Brother Genuine replacement high-yield toner cartridges like the TN-660 not only produces sharp, black and white pages with the quality you expect from Brother products – it also increases productivity and can reduce downtime when fulfilled through Amazon Dash Replenishment. The Brother TN-660 replacement laser black toner cartridge is for use with 16 Brother products. This professional cartridge is intelligently engineered to work in seamless unison without compromising the quality of the print. Upon activation, Amazon Dash Replenishment eligible Brother printers will seamlessly order Brother Genuine supplies through your Amazon account and ship them directly to your door. The Brother Genuine TN-660 replacement high-yield black toner cartridge can print approximately 2,600 pages(1). Once you’ve ordered your replacement cartridges from Amazon, you can feel comfortable knowing that Brother has an environmentally smart solution. Brother is dedicated to being environmentally responsible and offers disposal programs for properly discarding its cartridges. This replacement cartridge is for use with the following Brother printers and all-in-ones; DCPL2520DW, DCPL2540DW, HLL2300D, HLL2305W, HLL2315DW, HLL2320D, HLL2340DW, HLL2360DW, HLL2380DW, MFCL2680W, MFCL2685DW, MFCL2700DW, MFCL2705DW, MFCL2707DW, MFCL2720DW, MFCL2740DW.", "price": {"value": "57.45", "currency": "$"}, "url": "https://www.amazon.com/Brother-Genuine-TN660-Yield-Cartridge/dp/B00LJO8EQS/ref=sr_1_48?qid=1684829529&s=computers-intl-ship&sr=1-48"}