{"title": "FH Group Automotive Floor Mats - Heavy-Duty Rubber Floor Mats for Cars, Universal Fit Full Set, Climaproof Floor Mats, Trimmable Floor Mats for Most Sedan, SUV, Truck Floor Mats Black", "asin": "B073H5QKMZ", "brand": "Black", "stars": "4.5", "reviewsCount": "15,486 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81DA90UdMqL._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Interior Accessories", "›", "Floor Mats & Cargo Liners", "›", "Floor Mats"], "description": "Protecting your car’s floors is essential. That’s why FH Group designed multiple styles of floor mats so you can choose the best option to protect your ride! Select between materials such as reliable heavy-duty rubber, classic carpet, luxurious faux leather, and cozy faux rabbit fur. We have floor mats for women, for men, and for everyone! If you want floor mats that protect your car’s floor at all times and from everything, choose some of our rubber and vinyl mats that feature tall outer edges and deep ridge channels to prevent any spill, mud, or dirt from going anywhere in your car. This tough material is also very easy to clean, so you can quickly shake, rinse or wash off any dirt, and the floor mats will be intact and good to go. If you are looking for a more aesthetically pleasing option that will not only protect your car’s interior but also enhance your vehicle's look, we have options for you! If you want a fancy and sleek look, go for our faux leather floor mats. This material not only looks sophisticated, but it also is tough and durable. If comfort and looks are your priority, we recommend our faux rabbit fur floor mats, which will make your car comfy and cozy. No matter what floor mat you choose, just know that FH Group’s products got you covered!", "price": {"value": "23.47", "currency": "$"}, "url": "https://www.amazon.com/FH-Group-F11311BLACK-Rubber-Channel/dp/B073H5QKMZ/ref=sr_1_322?qid=1684811557&s=automotive-intl-ship&sr=1-322"}