{"title": "eMedia Guitar Method v6 - with Pitchboy Mini Keyring Tuner (Amazon-Exclusive)", "asin": "eMedia", "brand": "September 12, 2017", "stars": "3.9", "reviewsCount": "11 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/91j9AobdE8L._AC_SX679_.jpg", "breadCrumbs": ["Software", "›", "Music", "›", "Instrument Instruction"], "description": "eMedia Guitar Method v6 makes it easy for anyone to learn guitar. This best-selling guitar instruction software features step-by-step lessons from University of Colorado-Boulder's Kevin Garry, Ph.D. New Interactive Feedback listens to your playing and shows you whether you are playing chords or notes correctly to help you learn faster. Over 190 easy-to-follow guitar lessons take you from basics such as holding, stringing, and tuning your guitar to playing chords, strumming patterns, and fingerpicking. Also covers reading guitar tabs and standard music notation, playing by ear and much more. eMedia Guitar Method teaches with songs in a variety of genres including rock, blues, folk, country, and classical - making learning fun and enjoyable. Learn how to play over 70 great guitar songs, including hits such as “Knockin' on Heaven's Door” by Bob Dylan, “Imagine” from John Lennon and “Rock'n Me” by Steve Miller! This Amazon-exclusive Guitar Method v6 includes a Pitchboy mini-keyring guitar tuner from EarMaster, a $9.95 SRP value! ATTENTION MAC USERS - Beginning with macOS 10.15 (Catalina), Apple has eliminated the option to run 32-bit apps on the Mac. If you wish to continue using our applications, which currently require 32-bit support, do not upgrade your operating system past Mac OS 10.14 (Mojave). Alternatively, you can retain an older Mac operating system on a separate drive partition. eMedia developers are currently working on software updates to support Catalina and future versions of macOS, but this is a major undertaking. eMedia is currently unable to foresee how long it will take to create these new versions. If you purchased your eMedia software on or after September 7, 2019, upon receiving proof of purchase eMedia Music will provide you with a free upgrade to a macOS 10.15 (Catalina)-compatible version of an eMedia application when it becomes available. All other registered owners of eMedia software will be qualified for discounted upgrades.", "price": {"value": "49.95", "currency": "$"}, "url": "https://www.amazon.com/eMedia-Guitar-Method-v6-Amazon-Exclusive/dp/B071KVSM3X/ref=sr_1_170?qid=1685339154&s=software-intl-ship&sr=1-170"}