{"title": "SAMSUNG T7 Shield 4TB, Portable SSD, up-to 1050MB/s, USB 3.2 Gen2, Rugged, IP65 Water & Dust Resistant, for Photographers, Content Creators and Gaming, Extenal Solid State Drive (MU-PE4T0S/AM), Black", "asin": "4.7\n4,851 ratings\n4.7 out of 5 stars", "brand": "7 Inches", "stars": "4.7", "reviewsCount": "4,851 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81Vq1DFJfkL.__AC_SY300_SX300_QL70_FMwebp_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Data Storage", "›", "External Solid State Drives"], "description": "Samsung T7 Shield Portable SSD delivers high performance on-the-go, not matter the terrain. It has an IP65 rating for water** and dust* resistance, with Dynamic Thermal Guard to manage heat control. Transfer huge files instantly. USB 3.2 Gen 2 and PCIe® NVMe™ achieve soaring sequential read/write speeds of up to 1,050/1,000 MB/s***, allowing you to edit directly from the drive. The rugged design and advanced outer elastomer add extra durability to even endure a 9.8 foot drop****. The T7 Shield is compatible with PC, Mac, Android devices, gaming consoles, and more*****. Included in the box are USB Type C-to-C and Type C-to-A cables****** for added convenience. Comes with a 3 Year warranty.*Consistent with IP65 rating, tested under controlled conditions: 2kg/m3 of active dust with a pressure under 2kPa for 8 hours. Dust resistant capabilities may vary depending on the actual conditions. **Consistent with IP65 rating, tested under controlled conditions: water flow of 100kPa for 3 minutes. Water resistant capabilities may vary depending on the actual conditions. ***Performance may vary depending on host configuration. To reach maximum read/write speeds of up to 1,050/1,000 MB/s, respectively, the host device and connection cables must support USB 3.2 Gen 2 and the UASP mode must be enabled. Test system configuration: ASUS Z270 ROG MAXIMUS IX HERO (USB 3.2 Gen2 Type-C), Intel(R) Core(TM) i7-7700K CPU @ 4.20GHz, OS- Windows 10 19H2. ****Tested to withstand 9.8-ft (3 meters) drop under controlled conditions. Drop resistance capability may vary depending on the actual environmental conditions. *****Compatibility with host devices may vary. Some operating systems may require T7 Shield reformatting. ******T7 Shield is compatible with USB 3.0 and USB 2.0. *******Source: 2003~2021 OMDIA data: NAND suppliers' revenue market share.", "price": {"value": "219.99", "currency": "$"}, "url": "https://www.amazon.com/SAMSUNG-Resistant-Photographers-MU-PE4T0S-AM/dp/B0BHZQGN26/ref=sr_1_17?qid=1684829519&s=computers-intl-ship&sr=1-17"}