{"title": "Baby Dove Sensitive Skin Care Baby Wash For Baby Bath Time Rich Moisture Tear-Free and Hypoallergenic, 20 oz (Packaging May Vary)", "asin": "B06X6CRHY7", "brand": "Unilever", "stars": "4.8", "reviewsCount": "12,815 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71U2REyPBcL._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Baby Care", "›", "Bathing", "›", "Soaps & Cleansers", "›", "Body Wash"], "description": "Baby bath time is special. And with baby skin being 30% thinner than ours, the best care is the gentlest. To help protect your little one’s delicate skin, we created Baby Dove Rich Moisture Hypoallergenic Baby Wash to help nourish and replenish your little one’s delicate skin during bath time. This tear-free and hypoallergenic baby wash for skin and hair ensures bath time is all about smiles, not tears. Made with 100% skin-natural nutrients, which are identical to those naturally found in skin, and prebiotic moisture to help replenish the essential moisture and nutrients that baby’s skin can lose during bath time. To use this baby wash, gently wet baby’s hair and skin with warm water, work into a lather, and rinse for touchably soft skin. This gentle wash is pediatrician recommended and dermatologist tested, and our caring formulas are created without dyes, parabens, phthalates or sulfates, so you can feel assured that this baby wash gives baby’s skin the complete care it needs. We know there’s no right or wrong way to be a parent – only your way. That’s why Baby Dove is here to help give you confidence that you’re providing the best skin care for your baby's skin. Our Tip to Toe Wash is sold in 6.5 oz., 13 oz., and 20 oz. bottles. Looking for something for your baby’s extra sensitive skin? Look for Baby Dove Fragrance Free Moisture Hypoallergenic Wash.", "price": {"value": "9.38", "currency": "$"}, "url": "https://www.amazon.com/Baby-Dove-Wash-Rich-Moisture/dp/B06X6CRHY7/ref=sr_1_121?qid=1684817487&s=baby-products-intl-ship&sr=1-121"}