{"title": "Dove Beauty Bar More Moisturizing Than Bar Soap for Softer Skin, Fragrance-Free, Hypoallergenic Beauty Bar Sensitive Skin With Gentle Cleanser 3.75 oz, 14 Bars", "asin": "USA", "brand": "B08LM7291W", "stars": "4.8", "reviewsCount": "14,211 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/716ryVfnNfL._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Skin Care", "›", "Body", "›", "Cleansers", "›", "Soaps"], "description": "Dove Sensitive Skin Beauty Bar combines classic Dove cleansers and ¼ moisturizing cream in a fragrance free, hypoallergenic bar that’s gentle enough for sensitive skin. And now, we are bringing you Dove's same great formula in an all-new look. Dermatologist recommended and suitable for daily use, it can be used as a hand soap, gentle facial cleanser and body soap. Proper sensitive skin care depends on having a cleanser that truly cares for your skin and won’t dry it out like an ordinary soap can. Washing with regular soap can cause skin to feel dry and tight. What makes Dove different. It’s the combination of gentle cleansers and moisturizing ingredients that help to nourish skin. With unscented, hypoallergenic cleansers and 1/4 moisturizing cream, Dove Beauty Bar can be used as a face cleanser, as well as a gentle cleanser for your body and hands, leaving you with instantly soft skin and lasting nourishment. The secret to beautiful skin is moisture, and no ordinary bar soap hydrates skin better than Dove. At Dove, our vision is of a world where beauty is a source of confidence, not anxiety. That’s why we are on a mission to help the next generation of women develop a positive relationship with the way they look—helping them raise their self-esteem and realize their full potential.", "price": {"value": "14.87", "currency": "$"}, "url": "https://www.amazon.com/Dove-Moisturizing-Fragrance-Free-Hypoallergenic-Effectively/dp/B08LM7291W/ref=sr_1_104?qid=1684824125&s=beauty-intl-ship&sr=1-104"}