{"title": "Disney 2nd Grade Active Leveling Advantage Buzz", "asin": "B00008WQ9I", "brand": "Disney Interactive", "stars": "3.5", "reviewsCount": "7 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/51W43R5YH9L._AC_.jpg", "breadCrumbs": ["Software", "›", "Children's"], "description": "Join Buzz Lightyear and Friends on a 2nd GradeLearning Mission!Product InformationThere are many places to play in Andy's room and with Buzz as host your secondgrader can create interact and solve problems in more than 40 essentiallearning skills. The developers of this software worked with renowned educatorsto create a nurturing and entertaining learning environment in which your childcan learn language arts multiplication reading music and geography to nameonly a few. Give your child a bright start and skills that will encourage alifelong love of learning.Developed using the Active Learning method Buzz Lightyear 2nd Grade encourageskids to Explore Discover and Create while they learn. Children craft their ownlearning experience while developing essential reasoning and problem solvingskills. A life-long love of learning is reinforced through stimulatingactivities and environments that inspire your child's creative thinkingprocess.  As second graders explore Andy's room they can benefit from thefollowing Active Learning enrichments: Learn through fun imaginative creative activities. Enhance listening perception and observation skills. Appreciate music and the arts. Develop abstract and critical thinking skills. Explore and experiment with a variety of positive choices. Realize enhanced confidence and self-esteem through successful problem solving.Skills Learned Double Digit Addition and Subtraction Prediction Spelling Word Building Using Verbal and Graphic Cues Rhyming Words Synonyms Deductive Reasoning Fractions Geometric Shapes Vocabulary Critical Thinking World Geography Spatial and Mapping Skills Multiplication Story Comprehension Reading Comprehension Nouns Verbs and Adjectives Creativity Telling Time Music Creativity Music Creativity Memory Reading LanguageActivities IncludeStrate", "price": {"value": "14..40", "currency": "$"}, "url": "https://www.amazon.com/Disney-Grade-Active-Leveling-Advantage/dp/B00008WQ9I/ref=sr_1_228?qid=1685339180&s=software-intl-ship&sr=1-228"}