{"title": "EcoTools Professional Makeup Cleaner for Makeup Brushes, Brush and Makeup Beauty Sponge Cleansing Shampoo, Fragrance Free, Hypoallergenic, Paraben Free, 6 fl.oz./ 177 mL Bottle", "asin": "B01BSB56OY", "brand": "Paris Presents Incorporated", "stars": "4.6", "reviewsCount": "51,183 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/614DjW+jVuL._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Tools & Accessories", "›", "Makeup Brushes & Tools", "›", "Brush Cleaners"], "description": "The EcoTools Makeup Brush and Sponge Shampoo is designed to wash away makeup, oil, and impurities from your brushes to improve their performance and give you a smoother makeup application. The shampoo is dermatologist tested, hypoallergenic, and free of parabens, phthalates, and petroleum-based ingredients to leave brushes clean, soft, and healthy. With the easy-to-use Cleansing Shampoo, your brushes will come back to life no matter what makeup look. The formula has been tested to effectively clean your makeup tools without all the bad stuff that can strip the tools of their use. After cleaning you will continue to achieve a streak-free look with buildable coverage that is not animal-tested and completely vegan! Whether you use them for the eyes, blush, foundation or to travel with, EcoTools makeup brushes flawlessly help apply products to your face regardless of skin tone and type. Made from recycled and sustainable materials to make you feel as good as you look with a classic flawless application to match. Clean Beauty. Clean Planet. EcoTools has you covered from head-to-toe to keep you and the planet glowing. From exceptional makeup brushes and blenders to crystal face rollers to a variety of practical bath brushes and accessories, our products are not only effective, but they are also vegan-friendly and cruelty-free. The Delicate Ecopouf made with recycled netting, turns any bath into a spa experience while makeup brush sets like the Start the Day Beautiful Kit help achieve a natural makeup look. EcoTools is the perfect addition to any beauty routine.", "price": {"value": "6.99", "currency": "$"}, "url": "https://www.amazon.com/Ecotools-Makeup-Brush-Cleansing-Shampoo/dp/B01BSB56OY/ref=sr_1_123?qid=1684824135&s=beauty-intl-ship&sr=1-123"}