{"title": "Colorations Construction Paper for Kids | 7 Colors - 600 Bulk Sheets of 9X12 - Assorted Pack of Heavy Duty Craft Paper", "asin": "B00826ENU2", "brand": "Discount School Supply - Excelligence", "stars": "4.8", "reviewsCount": "1,131 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/712-HyqYtIL._SX342_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Paper & Paper Crafts", "›", "Paper", "›", "Construction Paper"], "description": "Bright, Assorted Construction Paper to Encourage Creativity & Cognitive Development for All Ages Use all 7 colors in the classroom or at home and for every craft! This paper is top-quality and designed for all ages of use. Whether you're decorating for the next party or your kids need colored construction paper in bulk for all their school projects, this is your paper! Heavyweight so it's especially for drawing, cutting, folding and crafting... well, anything. Nurturing Children's Creativity This paper aims to inspire. Kids can use this construction paper as coloring paper or for various shapes and designs... or maybe to make their favorite character. Or a sign for an upcoming holiday! Chemical free you know it's safe, that's as important to us as it is to you and your family. Inspire Creativity at Home & in the Classroom Encouraging sensory stimulation, self expression, and hours of creativity are the ONLY goals of this construction paper for kids. Our goal is to create WITH them, not for them - so this stealthily stimulates the cognitive development of your child without stress. Cutting, drawing and pasting construction paper strengthens fine motor skills just like any art and craft. And if you're ever unsatisfied with your bulk pack order, just reach out and we'll make it right.", "price": {"value": "39.99", "currency": "$"}, "url": "https://www.amazon.com/Colorations-BRITESTK-Bright-Construction-Paper/dp/B00826ENU2/ref=sr_1_223?qid=1684768660&s=arts-crafts-intl-ship&sr=1-223"}