{"title": "Wahl Color Pro Cordless Rechargeable Hair Clipper & Trimmer – Easy Color-Coded Guide Combs - for Men, Women, & Children – Model 9649P", "asin": "Wahl Clipper Corp", "brand": "043917004990 043917101712", "stars": "4.6", "reviewsCount": "67,743 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61HfweGzmgL._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Hair Care", "›", "Hair Cutting Tools", "›", "Hair Clippers & Accessories", "›", "Hair Clippers"], "description": "The Wahl Color Pro Cordless Clipper kit features color-coded combs that make it quick and easy to find the right comb size. The convenient color code guide on the clipper helps make it easy to identify the right size and comb color in seconds. Finding and remembering everyone’s favorite hair length is easier than ever. Corresponding the correct comb to the right cutting length is simple with our easy-to-see attachment guards. With a variety of cutting lengths, adjusting the trim length is pain-free. Quickly reference the color key on the face of the clipper and attach the corresponding-colored clipper comb attachment. The clipper powerful, long-lasting rechargeable battery with a run time of up to 60 minutes. Clipper can be used with or without a cord for ultimate convenience. Includes a self-sharpening stainless-steel blade with outstanding cutting performance. The stainless-steel blade can also easily be removed for easy cleaning. Color Pro Cordless is rechargeable and wireless. Cord/Cordless allows you to use the clipper on the battery or when it's charging. Since our blades are removable and rinseable they are easy to clean. Simply run them under water to wash away excess clippings and trimmings. The Color Pro Cordless color-coded haircutting kit includes the clipper with blade guard, a complete set of color-coded attachment guards, haircutting accessories, and full-color instructions with step-by-step guidance for an easy goof-proof at-home haircut. A premium hard storage case is also included for added convenience. Worldwide voltage (110 - 240V) for universal use at home or internationally. The product in the packaging may not be the same as in the photo due to continuous improvements to the product. Note: We test our clippers for cutting performance prior to packaging with a hygienic fiber. We do our best to clean the product to remove any testing particles, but it is possible a few may remain. They are not hair and can be simply wiped off.", "price": {"value": "39.99", "currency": "$"}, "url": "https://www.amazon.com/Wahl-Clipper-Rechargeable-Professionals-9649/dp/B01N0993NM/ref=sr_1_145?qid=1684824147&s=beauty-intl-ship&sr=1-145"}