{"title": "NOCO GENIUS5, 5A Smart Car Battery Charger, 6V and 12V Automotive Charger, Battery Maintainer, Trickle Charger, Float Charger and Desulfator for Motorcycle, ATV, Lithium and Deep Cycle Batteries", "asin": "B07W8KJH44", "brand": "NOCO", "stars": "4.6", "reviewsCount": "14,817 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81UVh1o+ayL._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Tools & Equipment", "›", "Jump Starters, Battery Chargers & Portable Power", "›", "Battery Chargers"], "description": "Meet the GENIUS5, one of our most powerful, highest-performing, energy-efficient, and compact portable universal battery chargers yet. The GENIUS5 is a 5-amp (75-watt) - 100-240VAC 50-60Hz - 6-volt and 12-volt heavy-duty battery charger, battery maintainer, trickle charger, float charger, and battery desulfator for up to 120 amp-hours. It's designed to charge and maintain all types of sealed lead-acid and lithium-ion (lifepo4) batteries, including flooded, gel, maintenance-free, AGM, SLA, VRLA, as well as automotive, marine, RV, powersports, and deep-cycle batteries. Its advanced battery repair regenerator mode uses slow pulse reconditioner technology to automatically detect battery sulfation and acid stratification, restoring lost battery performance for extended battery life. It can be used and stored almost anywhere - home, garage, mobile, bench, or in car - to charge and maintain any battery - even plug in through your vehicle's 12V auxiliary cigarette lighter port. Its next-generation charging regime utilizes fast charging microprocessor technology to rapidly recharge batteries without any manual intervention. It's a completely automatic, worry-free, professional, and commercial-grade intelligent battery charger with zero overcharge. Designed to be dual purpose - both indoors and outdoors - providing weatherproof and waterproof protection from the outside elements during any time of the year, including winter. Its X-Connect battery connectors - better than SAE - allow for quick-connect permanent connection or connecting directly to the battery terminals. A digital display provides the charging status and tests diagnostics for multiple conditions such as a dead battery, bad battery, reverse polarity, and more. And it's compatible with all types of gas and diesel vehicles, including cars, automobiles, motorcycles, dirt bikes, scooters, mopeds, lawn mowers, ATVs, UTVs, lawn tractors, trailers, trucks, SUVs, boats, campers, RVs, jet skis, PWCs, wave runners, snowmobiles, 4-wheelers, generators, golf carts, classic cars, including BMW, Mercedes-Benz, Porsche, Bentley, Maserati, Lexus, VW, Audi, Ford, Chevrolet, Corvette, Cadillac, Jeep, Prius, Toyota, Subaru, Nissan, Honda, Harley-Davidson, Suzuki, Yamaha, Kawasaki, Ducati, KTM, Indian, Husqvarna, Vespa, Polaris, Seadoo, John Deere and more.", "price": {"value": "69.95", "currency": "$"}, "url": "https://www.amazon.com/NOCO-GENIUS5-Fully-Automatic-Temperature-Compensation/dp/B07W8KJH44/ref=sr_1_103?qid=1684811464&s=automotive-intl-ship&sr=1-103"}