{"title": "Sculpey Premo 24 Color sampler of Polymer Oven-Bake Clay, Non Toxic 1.5 lbs., Great for jewelry making, holiday, DIY, mixed media and more. Premium clay Great for clayers and artists.", "asin": "B007QNEGIG", "brand": "Sculpey", "stars": "4.6", "reviewsCount": "724 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/513+QcaZZRL._AC_SY355_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Ceramics & Pottery", "›", "Clays & Doughs", "›", "Clay"], "description": "Versatile - Sculpey Premo is a premium Oven-Bake clay based on an artists mixing palette - perfect for creating custom colors. Mix with other colors, powders or pigments for interesting colors and textural effects. Flexible, exceptional strength and durable perfect for advanced techniques like caning, mokume gane and mica shift. Sculpey Premo is the best brand of clay for caning because the colors do not bleed and the clay maintains crisp lines. Perfect for jewelry, home décor, mixed media, holiday and more! Polymer oven-bake clay is a versatile medium that is perfect for crafters/makers of all ages. Polymer Oven Bake Clay - Sculpey Premo clay conforms to ASTM D-4236 and EN 71 safety standards, it is non-toxic and safe to use in your home oven. Simply make your polymer oven bake clay creation and bake in your home or toaster oven at 275 °F for about 30 minutes depending on the size of your creation. After baking, it can be sanded, drilled, carved and painted with water-based acrylic paints.  This oven bake clay will not dry out, so you can take your time crafting and not have to rush to finish your projects like you do with air dry clay. Maximum creativity - This clay is strong and holds detail making it the perfect choice for advanced techniques like caning, mokume gane and mica shift. Sculpey Premo comes in 54 densely saturated colors including glitters, metallics, pearls, granites and translucents. Retains flexibility after baking so the finished product remains very strong and durable.", "price": {"value": "12..56", "currency": "$"}, "url": "https://www.amazon.com/Sculpey-sampler-Polymer-Oven-Bake-artists/dp/B007QNEGIG/ref=sr_1_1597?qid=1684769328&s=arts-crafts-intl-ship&sr=1-1597"}