{"title": "Ubbi Disposable Diaper Pail Plastic Bags, Value Pack, 75 Count, 13-Gallon Bags", "asin": "B00ZT38BIQ", "brand": "Ubbi", "stars": "4.9", "reviewsCount": "7,590 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81UDWgUNV5L._AC_SY550_.jpg", "breadCrumbs": ["Baby Products", "›", "Diapering", "›", "Diaper Pails & Refills", "›", "Diaper Disposal Bags"], "description": "The Ubbi Plastic Bags are an option for the Ubbi Diaper Pail, although not a requirement. Depending on your needs, you can choose between a single box of 25 bags or a convenient triple value pack of 75 bags. Each unscented bag has a capacity of 13-gallon and is made of 20% recycled material. These plastic bags aren’t a must, just a plus! Enter the world of Ubbi where innovative products are designed and created with parents and children in mind. Under the Ubbi name, you will find unique, quality products that are easy to use, helping to simplify parent’s lives while keeping babies as happy and safe as can be. Thanks to its award-winning can of steel, Ubbi is now a recognized brand worldwide. The Ubbi diaper pail is renowned for its ability to achieve maximum odor control and appreciated for offering the convenience and value of utilizing any standard trash bag or reusable cloth liner, a breakthrough in the diaper disposal market. With the same customer focused philosophy and innovative design capabilities, the Ubbi brand is now expanding its signature diapering selection and extending into the feeding category. A wide range of Ubbi branded products is now available for today’s modern parents that are looking for stylish and functional baby essentials. From concept to final creation, the Ubbi team works together every step of the way to bring the best in design and value. The input of every member of the team is taken into account in the development of the Ubbi products, but consumer input is the most important as customer satisfaction is our primary goal.", "price": {"value": "19.99", "currency": "$"}, "url": "https://www.amazon.com/Ubbi-Disposable-Recyclable-Material-13-Gallon/dp/B00ZT38BIQ/ref=sr_1_73?qid=1684817466&s=baby-products-intl-ship&sr=1-73"}