{"title": "Fitbit Inspire 3 Health & Fitness Tracker with Stress Management, Workout Intensity, Sleep Tracking, 24/7 Heart Rate and more, Midnight Zen/Black One Size (S & L Bands Included)", "asin": "B0B5F9SZW7", "brand": "Fitbit Inc", "stars": "4.5", "reviewsCount": "4,301 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61gFrSlmofL.__AC_SX300_SY300_QL70_FMwebp_.jpg", "breadCrumbs": ["Sports & Outdoors", "›", "Exercise & Fitness", "›", "Fitness Technology", "›", "Activity & Fitness Trackers"], "description": "Do what you love and feel your best with Inspire 3. This little health hack on your wrist helps you stay on top of your stress, fitness and sleep—all you have to do is wear it. Track Health Metrics like skin temperature & blood oxygen, plus get daily scores that show how ready you are to work out or how well you’re managing stress. Fitbit is part of the Google family. 1) Requires a Fitbit Premium membership. Premium content recommendations are not available in all locales and may be in English only. 2) Irregular rhythm notifications are only available in select countries and with select Fitbit products; not intended for use by people under 22 years old or with other known arrhythmias. See fitbit.com/irregularrhythm for additional details. 3) Not available in all markets. The SpO2 feature is not intended to diagnose or treat any medical condition or for any other medical purpose. It is intended to help you manage your well-being and keep track of your information. 4) When phone is nearby. 5) Varies with use and other factors. 6) 6 months of Premium for New Premium users only. Must activate with device. Valid payment method required. Free trial must be activated within 60 days of device activation. Cancel before free trial ends to avoid subscription fees. Requires use of Fitbit app with compatible iPhone or Android devices. A Google account will be required.", "price": {"value": "79.95", "currency": "$"}, "url": "https://www.amazon.com/Fitbit-Management-Intensity-Tracking-Midnight/dp/B0B5F9SZW7/ref=sr_1_44?qid=1685333533&s=electronics&sr=1-44"}