{"title": "Philips AVENT Natural Baby Bottle with Natural Response Nipple, Clear, 9oz, 4pk, SCY903/04", "asin": "B0964CHD65", "brand": "9.4 x 8.73 x 2.96 inches", "stars": "4.7", "reviewsCount": "11,854 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/51On99BknSL._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Feeding", "›", "Bottle-Feeding", "›", "Bottles"], "description": "Philips Avent Natural bottle with the Natural Response nipple lets baby control the pace of the milk, like they do when breastfeeding. The nipples' unique opening and tip only releases milk when your baby actively drinks. When pausing to swallow and breathe no milk flows. Baby can drink, swallow, and breathe using their natural rhythm, just like they do when breastfeeding. Easily combine breast and bottle feeding with a wide breast-shaped nipple with a soft feel that mimics the shape and feel of a breast; plus baby controlling the flow of milk like they do when breastfeeding. The nipple has a no-drip design which helps prevent lost milk from the tip. An anti-colic valve integrated into the nipple is designed to reduce colic and discomfort by sending air away from your baby's tummy. The ergonomic shape makes it comfortable for parents to hold and easy for small fingers to grasp. Assembly is simple with only a few parts and the wide bottle neck makes filling and cleaning easy. The Natural bottle is made from polypropylene, a BPA free material, and works with all nipples and caps from the Natural line. The Natural response nipples come in flow rates 1-5, to keep up with your baby's growth. Includes: 4 9oz Natural bottles with Natural Response nipples, flow 3. SCY903/04 What to expect when introducing the Philips Avent Natural Response Nipple It is totally natural for your baby to take 2-3 tries to get milk flowing from a new bottle. Unlike traditional bottles the Natural bottle is designed to only release milk when your baby is actively drinking, like what happens when babies breastfeed. We have 5 different nipple flow rates for the Natural bottle. When looking for the right nipple flow rate, age is a guide, but your baby's approach to drinking and the feeding cues they will show will help determine when to move to a higher or lower nipple flow rate.", "price": {"value": "29.99", "currency": "$"}, "url": "https://www.amazon.com/Philips-AVENT-Natural-Bottle-Response/dp/B0964CHD65/ref=sr_1_128?qid=1684817487&s=baby-products-intl-ship&sr=1-128"}