{"title": "OEMTOOLS 87009 No-Spill Coolant Funnel Kit, Near Universal Fitment, Translucent, 15 Piece Set, Cooling System Funnel Allows Access To Hard-To-Reach Radiators , White", "asin": "OEMTOOLS", "brand": "January 1, 2016", "stars": "4.7", "reviewsCount": "7,567 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/6157JsJEAvL._SX342_.jpg", "breadCrumbs": ["Automotive", "›", "Tools & Equipment", "›", "Oil System Tools", "›", "Funnels"], "description": "The most important part of any car repair toolset, oil or power steering changing kit, or coolant pressure tester kit is a good solid funnel. Our Coolant Funnel Kit funnels power-steering fluid, funnels coolant and oil funnels automotive fluids of all types. The OEMTOOLS universal radiator flush funnel fill kit is intelligently designed to fill radiator fluid without over filling or spilling. The fluid stopper allows you to carefully control the flow of coolant from your coolant funnel into the radiator. And the translucent coolant spill free funnel allows you to keep a close visual on your fluids as you’re funneling them into your vehicle, forever avoiding overfills. All of this combines to form a radiator fill tool kit that’s second to none, and is miles better than the old funnel with hose style of coolant refill kits. The OEMTOOLS 87009 No-Spill Coolant Filling Funnel Kit provides a quick and easy way to fill automotive cooling systems while preventing spills and trapped air. Numerous adapters and extensions are included with this radiator spill free funnel kit to fit radiators or surge tanks on most domestic and import cars and light trucks, making this a must-have automotive funnel for anyone who owns an automobile. Add this no spill funnel kit to your coolant tester kit or your antifreeze tester kit to funnel automotive fluids of all types. This long funnel is capable of handling so many jobs, including after an engine flush or coolant flush. It works just as well as an oil funnel or transmission funnel as it does as a coolant flush funnel", "price": {"value": "87..70", "currency": "$"}, "url": "https://www.amazon.com/OEMTOOLS-87009-No-Spill-Coolant-Filling/dp/B01A2CQSU6/ref=sr_1_294?qid=1684811547&s=automotive-intl-ship&sr=1-294"}