{"title": "Baby Dove Sensitive Skin Care Baby Wash For Baby Bath Time Fragrance Free Moisture Fragrance Free and Hypoallergenic, Washes Away Bacteria 20 oz", "asin": "B06X3SD4VC", "brand": "Unilever", "stars": "4.8", "reviewsCount": "10,985 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61O6aquKKNL._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Baby Care", "›", "Bathing", "›", "Soaps & Cleansers", "›", "Body Wash"], "description": "Baby bath time is special. And with baby skin being 30 percent thinner than ours, the best care is the gentlest. To help protect your little one’s skin, we created Baby Dove Fragrance Free Moisture Hypoallergenic Baby Wash to provide ultra-gentle care for baby's sensitive skin. Unlike other baby washes, our tear-free and hypoallergenic baby wash and shampoo is made with 100 percent skin-natural nutrients, which are identical to those naturally found in skin, and prebiotic moisture to help replenish the essential moisture and nutrients that baby’s skin can lose during bath time. This fragrance free baby bath wash is safety-tested and pediatrician recommended. And our caring formula is gentle enough to use on newborns and free of dyes, parabens, sulfates, and phthalates. To use this baby wash, gently wet baby’s hair and skin with warm water, work into a lather, and rinse for touchably soft skin. We know there’s no right or wrong way to be a parent – only your way. That’s why Baby Dove is here to help give you confidence that you’re providing the best skin care for your baby's skin. Our Fragrance Free Moisture Hypoallergenic Baby Wash is sold in 13 oz. and 20 oz. bottles. Looking for something for a calming bedtime routine? Look for our Baby Dove Calming Moisture Baby Wash and Shampoo.", "price": {"value": "8.60", "currency": "$"}, "url": "https://www.amazon.com/Baby-Dove-Wash-Sensitive-Moisture/dp/B06X3SD4VC/ref=sr_1_122?qid=1684817487&s=baby-products-intl-ship&sr=1-122"}