{"title": "Efferdent Retainer Cleaning Tablets, Denture Cleanser Tablets for Dental Appliances, Complete Clean, 126 Tablets", "asin": "USA", "brand": "B01498R95W", "stars": "4.8", "reviewsCount": "18,460 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71TA9FSDA9L._SY355_.jpg", "breadCrumbs": ["Health & Household", "›", "Oral Care", "›", "Denture Care", "›", "Cleansers"], "description": "You'll smile with confidence knowing that your teeth and gums are clean, bright and healthy. Efferdent Complete Clean antibacterial cleaner tablets provide an everyday, odor-free clean. Efferdent’s Oxi-Action cleaning tablets give a complete clean by eliminating the most stubborn stains in hard-to-reach places The effervescent cleaning action reduces plaque buildup and brightens retainers, dentures and aligners. It also removes food particles that can cause gum irritation, so your mouth will feel just as good as it looks. Efferdent Complete Clean retainer cleaner tablets kill 99.99% of odor-causing bacteria in 3 minutes; while being gentle, non-abrasive and safe to use daily. Efferdent cleans full plate dentures, partials, retainers, aligners and other dental appliances. The cleaner tablets can be used in any dental bath. To use, drop one Complete Clean tablet into very warm water, enough water to cover the dental appliance. Then place the appliance into the effervescing solution, which will change color as it cleans. After 3 minutes remove and rinse dental appliance thoroughly. For best results gently brush the appliance with the cleanser solution using a soft brush, then rinse again. Efferdent gives a variety of cleaning types: Complete Clean, Essential Clean, Minty Fresh & Clean and Overnight Clean. Efferdent is the first denture and retainer cleaning tablet brand accepted by the American Dental Association. No wonder dental appliance wearers feel confident when they use Efferdent Dental Appliance Cleansers.", "price": {"value": "5.74", "currency": "$"}, "url": "https://www.amazon.com/Efferdent-Denture-Cleanser-Tablets-Complete/dp/B01498R95W/ref=sr_1_150?qid=1684824147&s=beauty-intl-ship&sr=1-150"}