{"title": "Lansinoh Lanolin Nipple Cream, Safe for Baby and Mom, Breastfeeding Essentials, 1.41 Ounces", "asin": "B005MI648C", "brand": "Lansinoh Laboratories", "stars": "4.8", "reviewsCount": "44,917 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71wJ5lmSoOL._AC_SX425_.jpg", "breadCrumbs": ["Baby Products", "›", "Feeding", "›", "Breastfeeding", "›", "Breast Shells & Creams"], "description": "Your breastfeeding must-have. #1 doctor recommended, our 100% natural nipple cream has been trusted by moms and healthcare providers for nearly 40 years to soothe and protect sore nipples. Ultra-purified and safe for baby - never any petroleum, parabens, additives, or preservatives, so there’s no need to remove before breastfeeding. Clinically tested and safe for sensitive skin, it also has no fragrance or taste for baby. Lansinoh Lanolin is ethically sourced, never tested on animals, and certified climate neutral. For nearly 40 years, new mothers have trusted Lansinoh to support and care for them while they enter the messy magic of motherhood. Born from one mother’s realization that birthing people often go without the support they need and deserve, Lansinoh proudly stands with mothers all over the world. Our journey started with award winning, doctor recommended HPA Lanolin Nipple Cream: today, we offer a comprehensive collection of solutions to help new parents navigate pregnancy, birth, breastfeeding, and pumping. Our product range includes organic nipple balm, disposable nursing pads, washable nursing pads, breastmilk storage bags, manual breast pumps and double electric breast pumps, postpartum essentials, baby bottles, and more. Lansinoh products are available in more than 70 countries and the company is committed to being climate neutral by 2030.", "price": {"value": "9.12", "currency": "$"}, "url": "https://www.amazon.com/Lansinoh-Lanolin-Breastfeeding-Soothing-Essentials/dp/B005MI648C/ref=sr_1_26?qid=1684817442&s=baby-products-intl-ship&sr=1-26"}