{"title": "SAMSUNG 980 PRO SSD 2TB PCIe NVMe Gen 4 Gaming M.2 Internal Solid State Drive Memory Card + 2mo Adobe CC Photography, Maximum Speed, Thermal Control (MZ-V8P2T0B)", "asin": "4.8\n27,257 ratings\n4.8 out of 5 stars", "brand": "2 TB Solid State Hard Drive", "stars": "4.8", "reviewsCount": "27,257 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71KeDAkw+0L._AC_SX450_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Data Storage", "›", "Internal Solid State Drives"], "description": "Unleash the power of the world’s No.1 memory flash drive brand since 2003. Samsung 980 PRO PCIe 4.0 NVMe SSD for next-level computing delivers twice the data transfer rate of PCIe 3.0, while maintaining compatibility with PCIe 3.0. Experience SSD performance with read speeds of up to 7,000 MB/s² and push the limits of what SDs can do. Powered by a new in-house controller that is designed to harmonize the flash memory components and the interface for superior speed, with a PCIe 4.0 interface that’s twice as fast as PCIe 3.0 SSDs and 12X faster than Samsung SATA SSDs5, every component of this NVMe SSD is manufactured by Samsung for performance that lasts. High performance SSDs usually require high performance thermal control. That’s why to ensure stable performance, the 980 PRO uses nickel coating to help manage the controller's heat level and a heat spreader label to deliver effective thermal control of the NAND chip. Designed for hardcore gamers and tech-savvy users, the 980 PRO memory card offers high-performance bandwidth throughput for heavy-duty applications in gaming, graphics, data analytics, and more. It's fast at loading games, so you can play more and wait less. The Samsung 980 PRO also comes in a compact M.2 2280 form, which can be easily plugged into desktop PCs and laptop computers, and due to its size and optimized power efficiency, it’s ideal for building high-performance computing systems. The NVM Express design mark is a registered trademark of NVM Express, Inc. Source: 2003-2020 IHS Markit data: NAND suppliers revenue market share. ²Performance may vary depending on the SSD’s firmware version and the system hardware & system configuration. Performance measurements are based on IOmeter 1.1.0. The write performances were measured with Intelligent TurboWrite technology being activated. The sequential write perform.To maximize the performance of the 980 PRO, please check whether your system supports PCIe 4.0 at the Intel or AMD website.Results are based on a comparison with Samsung PCIe 3.0 NVMe SSDs and SATA SSDs. 5Test system configuration: AMD Ryzen 9 3900X 12-Core Processor CPU@3.79GHz, DDR4 2666MHz 16GBx2, OS-Windows 10 Pro 64bit, Chipset-ASUS-X570-ROG CROSSHAIR VIII FORMULA.", "price": {"value": "129.99", "currency": "$"}, "url": "https://www.amazon.com/SAMSUNG-Internal-Gaming-MZ-V8P2T0B-AM/dp/B08RK2SR23/ref=sr_1_10?qid=1685333511&s=electronics&sr=1-10"}