{"title": "Colorations - SWT16 Simply Washable Tempera Paints, 16 fl oz, Set of 11 Colors, Non Toxic, Vibrant, Bold, Kids Paint, Craft, Hobby, Arts & Crafts, Fun, Art Supplies", "asin": "China", "brand": "B005E9KJYE", "stars": "4.7", "reviewsCount": "2,053 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61nXq94oOIL._SX342_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Painting, Drawing & Art Supplies", "›", "Painting", "›", "Paints"], "description": "Encourage Creativity with Vibrant, Washable Tempera Paints At Colorations, we created our kids washable paint to easily wash from most surfaces. Smooth, creamy, and beautifully vibrant, our versatile craft paint lets kids create how they want to. Ideal for all kinds of projects on non-greasy, absorbent surfaces like construction paper, drawing paper, cardboard, plaster cloth, and papier-mâché. For a variety of fun effects, use them with brushes, sponges, stamps, rollers, and more. Whether used at home or the classroom, our 11 count, 16 oz kids painting bottles set has all the washable kids paint needed for endless creation. With black, blue, brown, green, magenta, orange, purple, red, white, turquoise, and yellow washable paint for toddlers that dries to a bright, matte finish designed to resist cracking, kids can make anything they dream up. Achieving ASTM-D4236 standard and AP Seal for safety, our kids art supplies also do not contain most common allergens including latex, dairy & casein, egg, gluten, peanut & tree nut, and soy to help make art accessible to all kids. At Colorations, we believe in empowering kids through artistic expression by providing quality, safe, and fun craft supplies made in the USA that let kids truly express themselves. If for any reason you don’t absolutely love your paint for toddlers, reach out and we will make it right.", "price": {"value": "51.20", "currency": "$"}, "url": "https://www.amazon.com/Colorations-Washable-Tempera-Vibrant-Supplies/dp/B005E9KJYE/ref=sr_1_676?qid=1684768861&s=arts-crafts-intl-ship&sr=1-676"}