{"title": "Lippert Solid Stance RV Step Stabilizer Kit for 5th Wheels, Travel Trailers and Motorhomes", "asin": "B08TJ36TBL", "brand": "Lippert", "stars": "4.6", "reviewsCount": "1,479 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81ZJQXPFbpS._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "RV Parts & Accessories", "›", "Exterior", "›", "Exterior Ladders & Steps", "›", "Steps"], "description": "Take the bounce out of your RV or trailer’s entrance step with the Solid Stance Step StabilizerTM Kit by Lippert. This is one of the most versatile RV step enhancements on the market that can ground most standard entry steps for improved stability and convenience. And better yet, this kit is compatible with all Lippert double and triple Steel Radius Steps as well as our double and triple Alumi-Tread® Hybrid Aluminum steps, plus a wide-variety of non-Lippert assemblies — making the Solid Stance the easy choice when it comes to upgrading your RV’s entry steps.The Solid Stance Step Kit comes complete with adjustable legs, mounting and installation hardware and a quick-release spring-loaded pull pin to adjust leg height. This stabilizer step kit is compatible with double and triple Lippert Steel Radius Entry Steps as well as our double and triple Alumi-Tread® Hybrid Aluminum Entry Steps -- plus, a wide-variety of competitor assemblies.Whether you’re on the road or on the water, Lippert supplies a broad array of premium RV, towing, and marine products designed to enhance all of your recreational pursuits. Our team is committed to always thinking about your next journey — pushing the possibilities of our products and services, all to better your time spent outdoors, whenever, wherever, for years to come.", "price": {"value": "44.95", "currency": "$"}, "url": "https://www.amazon.com/Lippert-Stabilizer-Trailers-Motorhomes-2020109777/dp/B08TJ36TBL/ref=sr_1_272?qid=1684811537&s=automotive-intl-ship&sr=1-272"}