{"title": "Thinkbaby SPF 50+ Baby Sunscreen – Safe, Natural Sunblock for Babies - Water Resistant Sun Cream – Broad Spectrum UVA/UVB Sun Protection – Vegan Mineral Sun Lotion, 6oz", "asin": "859871004170", "brand": "baby-boys", "stars": "4.7", "reviewsCount": "9,225 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/41f5E+Hqt8L._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Baby Care", "›", "Grooming", "›", "Skin Care", "›", "Sun Protection"], "description": "About Thinkbaby / Thinksport We are guided by the 'Precautionary Principle' for everything product we bring to market. With over a decade of leadership in product safety, Thinkbaby Thinksport works with leading institutions and scientists to develop products that are both safe for your children and safe for the environment your kids live in. We are focused on your child's safety while making products that are functional. Thinkbaby Sunscreen - Safe for Your Family, Safe for the Ocean (Size: 6 Ounce, Pack of 1) Thinkbaby Safe Sunscreen was the first sunscreen to pass Whole Foods Premium Care requirements and has held the highest rating in EWG's database since 2010 with a “1” rating. As a company, we led the movement from BPA, with the 1st BPA-free baby bottle (2006) to the 1st insulated BPA-free sports bottle (2006). We brought the same focus to developing body care and sun care products. SPF 50+, Broad Spectrum, UVA & UVB Protection We are strictly against the use of aerosols due to inhalation concerns to the effectiveness and safety for users and the environment. Our mineral based (zinc oxide) formulations go on smooth and absorb easily without leaving you feeling sticky or goopy. Safe for Sensitive Skin Broad-spectrum protection for UVA and UVB Highest Water Resistance Allowed by FDA Non-Aerosol, Free from Biologically Harmful chemicals Applies & Absorbs Easy, no sticky goopy feel Reef Safe Formula First to pass Whole Foods Premium Care requirements Top-Rated by EWG in 2010 with a #1 Rating Highly Biodegradable Paraben, PABA Free, Vegan, Non-Toxic & Gluten Free", "price": {"value": "19.39", "currency": "$"}, "url": "https://www.amazon.com/Thinkbaby-Safe-Sunscreen-SPF-ounce/dp/B00JJZN1HG/ref=sr_1_15?qid=1684817433&s=baby-products-intl-ship&sr=1-15"}