{"title": "VELCRO Brand Sticky Back for Fabrics, 10 Ft Bulk Roll No Sew Tape with Adhesive, Cut Strips to Length Permanent Bond to Clothing for Hemming Replace Zippers and Snaps, White", "asin": "USA", "brand": "B09P8G549Q", "stars": "4.2", "reviewsCount": "560 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81yfKx3JQ-L._SX342_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Sewing", "›", "Sewing Notions & Supplies", "›", "Fasteners", "›", "Interlocking Tape"], "description": "VELCRO Brand Sticky Back for Fabrics tape just might be the most convenient tool in your sewing kit! Use this no-sew fastener in place of buttons, snaps, zippers or hook and eye closures. It’s easy to use and so durable it can withstand laundering (cold water wash and tumble dry low). And it has all the strength you expect from a VELCRO Brand product. Hemming tape for dresses, Fabric tape for hemming can also be used to hem pants without sewing, fabric adhesive VELCRO Brand snap tape is perfect for your wardrobe. Ideas become projects you can act on today with Sticky Back for Fabrics. Create pillows, curtains, seasonal decorations, and so much more. Put together costumes for the kids or just make the ones from last year fit. If you can imagine it, Sticky Back for Fabrics can help you make it happen - it’s as easy as “peel, stick, done.”, perfect to use as hemming tape for pants. Need a quick repair? No problem. Sticky Back for Fabrics has got you covered. You can repair hems, close a seam, or add an embellishment. All without a needle and thread, ironing, or messy glues. And those on-the-go repairs are fixed for good. Sticky Back for Fabrics will last through hundreds of washes without losing its grip. Better than hem glue no sew no iron. Sticky Back for Fabrics works on cotton, polyester, poly blends, and nylon. This bulk roll of fabric VELCRO Brand sticky tape for clothes is the perfect no sew hemming tape ; strips with adhesive for fabric can be adjusted to the perfect size by cutting roll to length. Sticky VELCRO Brand stgrips with adhesive for cloth ar ther perfect no sew clothing solution. PERFECT FOR DOG CLOTHES: VELCRO Brand tape with adhesive for fabrics is a great choice when working on neck and tummy closures for dog clothing. Hook and loop fabric adhesive tape is the perfect non iron tape for all clothing needs, cut to length adhesive strips for fabric", "price": {"value": "13.04", "currency": "$"}, "url": "https://www.amazon.com/VELCRO-Brand-Adhesive-Permanent-Clothing/dp/B09P8G549Q/ref=sr_1_173?qid=1684768639&s=arts-crafts-intl-ship&sr=1-173"}