{"title": "Faber-Castell Black Edition Colored Pencils - 36 Count, Black Wood and Super Soft Core Lead, Coloring Pencils for Kids, Teens, Adult Coloring Books, Art Colored Pencils", "asin": "B086WNYTPZ", "brand": "Faber-Castell", "stars": "4.6", "reviewsCount": "3,610 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81MiajJYQOL._AC_SY355_.jpg", "breadCrumbs": ["Office Products", "›", "Office & School Supplies", "›", "Writing & Correction Supplies", "›", "Pencils", "›", "Wooden Colored Pencils"], "description": "Endless creativity awaits with Faber-Castell Black Edition Colored Pencils! Featuring black wood and a pre-sharpened, soft-core pencil lead, your adult coloring pages will pop with brilliant colors on light, colored, or even dark paper. An eco-friendly art supply choice for drawing and adult coloring, Faber-Castell colored pencils are proudly manufactured with carbon-neutral production and use reforested pencil wood grown in FSC-certified sustainable forests. See your artwork and adult coloring work come to life in vibrant colors with Faber-Castell pencils. Faber-Castell colored pencils feature 36 art pencils in neon and pastel colors. Black Edition coloring pencils feature brilliant, pigment-packed colors with an extra smooth color laydown thanks to their super soft core lead. These quality colored pencils are especially vibrant on dark paper, bringing a vibrant color laydown to every artwork piece. The Faber-Castell coloring pencil features a triangular shape which ensures the correct grip position with optimum comfort and prevents hand fatigue when creating art. Just add creativity to bring your adult coloring books to life with brilliant colors. Faber-Castell colored pencils are of professional quality and feature an extra break-resistant lead that is glued the entire length of the pencil to ensure excellent point retention, limitless adult coloring, drawing, and easy sharpening. Experience creativity with Faber-Castell coloring pencils! Since 1761, Faber-Castell has proudly created artist-quality tools for creatives of all ages and skill levels, designed to inspire creativity and self-expression.", "price": {"value": "17.83", "currency": "$"}, "url": "https://www.amazon.com/Faber-Castell-Colouring-Pencils-Assorted-Colours/dp/B086WNYTPZ/ref=sr_1_1637?qid=1684769367&s=arts-crafts-intl-ship&sr=1-1637"}