{"title": "McAfee Total Protection 2023 | Unlimited Devices | Antivirus Internet Security Software | VPN, Password Manager & Parental Controls | 1 Year Subscription | Key Card", "asin": "B07C69HHFF", "brand": "McAfee", "stars": "4.5", "reviewsCount": "1,240 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61Dt11ez5nL._AC_SY606_.jpg", "breadCrumbs": ["Software", "›", "Antivirus & Security", "›", "Internet Security Suites"], "description": "All-in-one online protection for your personal info and privacy, so you can enjoy your life online. We make online security simple so you can bank, shop, browse, and connect with confidence. Access robust tools like Dark Web Monitoring and automated Secure VPN from any device, and be greeted with a consistent experience that meets you where you are. McAfee Secure VPN is now automated and integrated in our online protection service so there’s no need to install a separate app, making it easier than ever for you to protect your personal info when away from home. By encrypting your internet traffic, you can keep your credit card and personal data safer from prying eyes. Whether you’re paying bills, managing investments, or just exploring, Secure VPN helps you stay private. Your VPN can turn on automatically for public Wi-Fi, protecting account credentials, search habits, and more. We’ll carry forward our promise as a trusted market leader to protect the personal data and devices of everyone in your household whether they’re tech power-users, sporadic users, or somewhere in between. We care about your safety, privacy, and identity. And with over 600 million devices and the people behind them covered, we’re leading the industry when it comes to keeping the world safer online. We’ll handle the risk while you enjoy life online.", "price": {"value": "39.99", "currency": "$"}, "url": "https://www.amazon.com/McAfee-Protection-Unlimited-Device-Activation/dp/B07C69HHFF/ref=sr_1_14?qid=1685339067&s=software-intl-ship&sr=1-14"}