{"title": "Torin T90413 Big Red Hydraulic Bottle Jack with Carrying Case, 4 Ton (8,000 lb) Capacity", "asin": "B00NOWOGYC", "brand": "4 Ton", "stars": "4.4", "reviewsCount": "2,739 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81WV+cUS1-L._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Tools & Equipment", "›", "Garage & Shop", "›", "Vehicle Lifts, Hoists & Jacks", "›", "Jacks", "›", "Floor Jacks"], "description": "The Torin Big Red hydraulic bottle jack is designed for residential and commercial use and has a wide, rugged base which enhances stability and strength. It's engineered using a drop forged alloyed steel construction with reinforced stress points for added durability. The inner/outer welded structure and steel construction will keep your bottle jack leak-free and gives it an overall stronger build. The fully welded structure is designed for hard-hitting commercial use, making large loads easy to lift. A serrated, heat-treated saddle provides a generous lifting area and a secure grip. The lifting range is 7.48\" to 14.49\" with a 4 ton (8,000 lb) capacity. It features a smooth, glide-action pressure pump designed to lift with minimal muscle and effort and has an integrated built-in oil-bypass and overload valve that protects the hydraulic system from extending beyond its travel limits. Hydraulics are powered with a high-quality oil, which offers better corrosion resistance and high/low temperature flexibility, allowing the unit to operate at temperatures between 40 degrees Fahrenheit and 105 degrees Fahrenheit. Piston ram utilizes a Y-style polyurethane sealing ring with backup ring, preventing the load from falling slowly. This lightweight and powerful bottle jack is ideal for lifting farm vehicles, heavy-duty machinery, industrial equipment, military applications, and environments where the equipment receives heavier abuse. This unit is 100% factory tested for reliability and safety to meet and comply with ASME safety standards..", "price": {"value": "23.67", "currency": "$"}, "url": "https://www.amazon.com/Torin-T90413-Bottle-Jack-Case/dp/B00NOWOGYC/ref=sr_1_226?qid=1684811516&s=automotive-intl-ship&sr=1-226"}