{"title": "Lansinoh Breast Therapy Packs with Soft Covers, Hot and Cold Breast Pads, Breastfeeding Essentials for Moms, 2 Pack", "asin": "B01J61VL9W", "brand": "0.79 x 6.1 x 6.5 inches", "stars": "4.6", "reviewsCount": "26,334 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81x1Y6cwMyL._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Feeding", "›", "Breastfeeding", "›", "Breast Shells & Creams"], "description": "The ultimate multi-tasker. These versatile little gems provide relief that’s a breastfeeding gamechanger. Lansinoh TheraPearl 3-in-1 Breast Therapy Packs provide hot or cold pain relief again and again for tender, overworked breasts. Simply pop them in the microwave or freezer – no boiling required. Use hot therapy to relieve clogged ducts and mastitis. Heat one pack at a time using the enclosed directions. Once warm, place in the soft cover and apply to your breast. Use cold therapy to relieve engorgement. To use as ice packs, place in the freezer for 4 hours prior to first use. Once cold, place in soft cover and apply to your breast. Pads can also be stored in the refrigerator. Use as a breast pump aid to encourage let-down and spend less time pumping. To use as a breast pump aid, heat according to the instructions and wrap around the breast pump flange. Do not overheat. Please follow heating instructions printed on the pads and in the packaging insert. Always test pack temperature prior to use. Breast therapy should be applied for 20 minutes, or as recommended by a doctor. Do not heat the soft covers. For nearly 40 years, new mothers have trusted Lansinoh to support and care for them while they enter the messy magic of motherhood. Born from one mother’s realization that birthing people often go without the support they need and deserve, Lansinoh proudly stands with mothers all over the world. Our journey started with award winning, doctor recommended HPA Lanolin Nipple Cream: today, we offer a comprehensive collection of solutions to help new parents navigate pregnancy, birth, breastfeeding, and pumping. Our product range includes organic nipple balm, disposable nursing pads, washable nursing pads, breastmilk storage bags, manual breast pumps and double electric breast pumps, postpartum essentials, baby bottles, and more. Lansinoh products are available in more than 70 countries and the company is committed to being climate neutral by 2030.", "price": {"value": "12.23", "currency": "$"}, "url": "https://www.amazon.com/Lansinoh-TheraPearl-Therapy-Breastfeeding-Essentials/dp/B01J61VL9W/ref=sr_1_86?qid=1684817466&s=baby-products-intl-ship&sr=1-86"}