{"title": "Chemical Guys SPI_402_16, Heavy Metal Polish Restorer and Protectant, 16 Ounce", "asin": "B00FALVXEQ", "brand": "Chemical Guys", "stars": "4.5", "reviewsCount": "6,238 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71+fC8y-oEL._AC_SX425_.jpg", "breadCrumbs": ["Automotive", "›", "Car Care", "›", "Exterior Care", "›", "Car Polishes & Waxes", "›", "Chrome & Metal Polishes"], "description": "Chemical Guys Vintage Heavy Metal Polish is a specialty metal polish designed to restore the brilliant shine to any metal surface. The all new Vintage Heavy Metal Polish is formulated with specialty cleaners to remove contamination and imperfections while restoring gloss and clarity. Chemical Guys Vintage Heavy Metal Polish works great to restore chrome, stainless steel, copper, aluminum, brass, silver and gold metalwork. Their unique micro-polishing formula safely polishes metal for a vibrant shine. The advanced protective polymers in Chemical Guys Vintage Heavy Metal Polish removes stains and contaminates that can dull the finish. Heavy Metal Polish is perfect for polishing diamond plate and precious metals. Quickly and easily restore the original shine to your metalwork with Chemical Guys Heavy Metal Polish. Perfectly polished metalwork is the best compliment to any car, truck, boat, or motorcycle. Chemical Guys Vintage Heavy Metal Polish helps to achieve the brilliant shine that any detailing enthusiast enjoys. Simply apply a few drops of Vintage Heavy Metal Polish to a premium microfiber applicator pad and gently work into any chrome, aluminum, stainless steel, silver, gold, or copper surface to reveal a bright, high gloss shine. The advanced micro-abrasive technology quickly cuts through oxidation to produce a beautiful finish. Chemical Guys Vintage Heavy Metal Polish can also be used with the Chemical Guys Ball Buster System for even faster results when polishing wheels, diamond plate, and large metal surfaces. Vintage Heavy Metal polish is formulated with protective polymer technology that protects your metalwork from stains and oxidation.", "price": {"value": "19.99", "currency": "$"}, "url": "https://www.amazon.com/Chemical-Guys-SPI_402_16-Restorer-Protectant/dp/B00FALVXEQ/ref=sr_1_78?qid=1684811453&s=automotive-intl-ship&sr=1-78"}