{"title": "SanDisk 2TB Extreme Portable SSD - Up to 1050MB/s - USB-C, USB 3.2 Gen 2 - External Solid State Drive - SDSSDE61-2T00-G25", "asin": "4.7\n42,609 ratings\n4.7 out of 5 stars", "brand": "2 TB Solid State Drive", "stars": "4.7", "reviewsCount": "42,609 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71V5mS+FNnL._AC_SX466_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Data Storage", "›", "External Solid State Drives"], "description": "Your life’s an adventure. To capture and keep its best moments, you need fast, high-capacity storage that accelerates every move. 1050MB/s read and 1000MB/s write speeds let you store your content and creations on a fast drive that fits seamlessly into your active lifestyle. Up to two-meter drop protection (3), with IP55 water and dust resistance (3), a Carabiner loop for securing the drive. From the brand trusted by professional photographers, the SanDisk Extreme Portable SSD provides fast solid state performance in a tough, reliable storage solution. 1GB = 1,000,000,000 bytes, 1TB = 1,000,000,000,000 bytes. Actual user capacity less. Up to 1050MB/s read speed, up to 1000MB/s write speed. Engineered with proprietary technology to reach speeds beyond UHS-I 104MB/s, requires compatible devices capable of reaching such speed. Based on internal testing; Performance may be lower depending on host device, interface, usage conditions and other factors. 1MB=1,000,000 bytes. (1) See official SanDisk website. (2) Password protection uses 256-bit AES encryption and is supported by Windows 8, Windows 10 and macOS v10.9+ (Software download required for Mac, see official SanDisk website.) (3) Based on internal testing. IPEC 60529 IP 55: Tested to withstand water flow (30 kPa) at 3 min; Limited dust contact does not interfere with the operation. Must be clean and dry before use.", "price": {"value": "11..65", "currency": "$"}, "url": "https://www.amazon.com/SanDisk-2TB-Extreme-Portable-SDSSDE61-2T00-G25/dp/B08HN37XC1/ref=sr_1_30?qid=1685333533&s=electronics&sr=1-30"}