{"title": "Brother Genuine Standard Yield Toner Cartridge, TN730, Replacement Black Toner, Page Yield Up To 1,200 Pages, Amazon Dash Replenishment Cartridge", "asin": "B075X7TFY5", "brand": "Brother Consumables", "stars": "4.7", "reviewsCount": "12,149 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/7197bPYLO4L._AC_SX425_.jpg", "breadCrumbs": ["Office Products", "›", "Office Electronics", "›", "Printers & Accessories", "›", "Printer Parts & Accessories", "›", "Printer Ink & Toner", "›", "Toner Cartridges"], "description": "The use of Brother Genuine replacement standard-yield toner cartridges like the TN-730 not only produces sharp, black and white pages with the quality you expect from Brother products – it also increases productivity and can reduce downtime when fulfilled through Dash Replenishment. The Brother TN-730 replacement laser black toner cartridge is for use with 9 Brother products. This professional cartridge is intelligently engineered to work in seamless unison without compromising the quality of the print. Upon activation, Dash Replenishment–eligible Brother printers will seamlessly order Brother Genuine supplies through your account and ship them directly to your door. The Brother Genuine TN-730 replacement standard-yield black toner cartridge can print approximately 1, 200 pages(1). Once you’ve ordered your replacement cartridges from , you can feel comfortable knowing that Brother has an environmentally smart solution. Brother is dedicated to being environmentally responsible and offers disposal programs for properly discarding its cartridges. This replacement cartridge is for use with the following Brother printers; DCPL2550DW, HLL2350DW, HLL2370DW, HLL2370DW XL, HLL2390DW, HLL2395DW, MFCL2710DW, MFCL2750DW, MFCL2750DW XL. (1)Approx. toner cartridge yields in accordance with ISO/IEC 19752 (Letter/A4) standards.", "price": {"value": "43.95", "currency": "$"}, "url": "https://www.amazon.com/Brother-TN730-DCP-L2550DW-MFC-L2710DW-MFC-L2750DW/dp/B075X7TFY5/ref=sr_1_34?qid=1685333533&s=electronics&sr=1-34"}