{"title": "NEIKO 20601A 14.5” Steel Tire Spoons Tool Set, Tire Tools Include 3 Piece Tire Spoons, 3 Piece Rim Protector, Valve Tool, 6 Piece Valve Cores, Motorcycle Tire Changer, Dirt Bike Tire Levers", "asin": "B082K7V2GZ", "brand": "Neiko", "stars": "4.5", "reviewsCount": "6,540 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/719JxN+pVWL._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Tools & Equipment", "›", "Tire & Wheel Tools", "›", "Tire Repair Tools"], "description": "20601A Neiko Tire Spoons Rim Protector and Valve Tool Set is the perfect tool for any mechanics, homeowners, or DIY-ers! Whether you’re working on a car or motorcycle, this complete package of tools is great for removing damaged tires. The set not only includes one, but three flexible rim guards to prevent any damage to the rims while using the tire spoons. As an added BONUS, the set includes 6 Brass Schrader Valve Cores for convenience. Product Features: - Tire spoons are constructed of high quality Hardened Steel-Iron for ultimate durability/strength - Chrome polish finish that protects the tool from rust/corrosion and allows for hassle-free cleaning - Curved tips allow for easy insertion to any and all applications - Extra long length lever at 14.5 inches to easily prop out damaged tires without using extra force - Ergonomic, contoured, rubberized groove handle provides a natural non-slip grip while reducing hand fatigue and maximizing leverage power - 4 point valve tool with mouth side for attachments of various bits, deflation needle side that can be used to deflate the needle or remove stuck rocks in tire grooves, valve core side for quick removal and installation of valve core stems, and the screw thread side to easily clean the threads of the wheel stems", "price": {"value": "21.24", "currency": "$"}, "url": "https://www.amazon.com/20601A-Professional-Changing-Motorcycle-Protector/dp/B082K7V2GZ/ref=sr_1_108?qid=1684811464&s=automotive-intl-ship&sr=1-108"}