{"title": "Home Designer Architectural", "asin": "USA", "brand": "B07BVB3PV9", "stars": "4.1", "reviewsCount": "63 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81EeBEQjGnL._AC_SY500_.jpg", "breadCrumbs": ["Software", "›", "Lifestyle & Hobbies", "›", "Home & Garden Design"], "description": "Home Designer Architectural is powerful home design software for DIY home enthusiasts. Created by Chief Architect, so you can enjoy the same tools that the professionals use for home design, remodeling, interior design, outdoor living, and cost estimation. Home Designer Architectural offers smart building tools to create 3D models, scaled plans, and elevations for your home projects. Home Designer Architectural makes designing and visualizing your ideas easy with powerful design tools that have commonly accepted defaults for most building practices to assist you in your home design projects. Home Designer automatically creates a 3D model once you draw your walls. And, in 3D, you can continue design work – adding cabinets, placing furniture, painting walls, or just visualizing your project. An extensive 3D Library of over 60,000 architectural objects makes it easy to design your perfect space. Home Designer uses smart design objects like doors and windows to create various styles and sizes quickly. Create any cabinet style by choosing colors, countertops, door styles, backsplash, crown molding, and hardware. Home Designer includes automated tools to create site plans, landscaping, decks, and patios. There are over 3,600 plants with detailed information about each plant, including integrated hardiness zone maps. Decking tools include automatic deck framing and a materials list for estimating. Get started quickly with easy how-to videos, step-by-step instructions, and free 1-year technical support. All Home Designer products include a 2-week money-back guarantee.", "price": {"value": "249.99", "currency": "$"}, "url": "https://www.amazon.com/Chief-Architect-Home-Designer-Architectural/dp/B07BVB3PV9/ref=sr_1_33?qid=1685339102&s=software-intl-ship&sr=1-33"}