{"title": "Bio-Oil Skincare Oil with Vitamin E, Serum for Scars and Stretchmarks, Face and Body Moisturizer for Sensitive Dry Skin, Dermatologist Recommended, Non-Comedogenic, For All Skin Types, 2 oz", "asin": "891038001004 890837851254 811487225202", "brand": "GNC|ALL|ALL|COSMETICS", "stars": "4.5", "reviewsCount": "44,721 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71lC6GnOWbL._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Skin Care", "›", "Body", "›", "Moisturizers", "›", "Oils"], "description": "Give your skin a break while stuck inside! It's the perfect time to take care of your skin with Bio-Oil Skincare Oil. Made for all skin types, this paraben-free body oil for dry skin can be used to help reduce the appearance of stretch marks, scars, and other marks due to surgery, injury, acne, aging, pregnancy, and more. This facial skin care product has a fast-absorbing, non-comedogenic formula that won't clog pores which is why it is the perfect face moisturizer for women. It helps the skin to retain essential moisture to soften skin and provide dry skin relief. Bio-Oil has a wide variety of uses and can be used as a facial moisturizer, lip moisturizer and hair moisturizer. Bio-Oil is also an oil for hair and because of its deeply moisturizing properties, Bio-Oil makes a great hair oil for black women. Additionally, Bio-Oil is a hair oil for dry and damaged hair and a hair oil for women with all hair types. Bio-Oil hair oil for curly frizzy hair and hair oil for men moisturizes and nourishes hair. It's truly a multi use oil that's recommended by skin care specialists. Use Bio-Oil as a beard oil, cuticle oil, hair oil, scalp oil, face oil, lip oil, and nail oil. The toxicological profile, chemical structure, level of inclusion and total level of daily exposure of each ingredient used has been assessed and deemed safe for use (including for use by pregnant women). Bio-Oil is proudly distributed in the USA by Kao USA, Inc. Satisfaction Guaranteed. Limitations may apply.", "price": {"value": "10.14", "currency": "$"}, "url": "https://www.amazon.com/Bio-Oil-2oz-Multiuse-Skincare-Oil/dp/B000VPPUEA/ref=sr_1_62?qid=1684824104&s=beauty-intl-ship&sr=1-62"}