{"title": "Brother Genuine High-Yield Black Toner Cartridge Twin Pack TN760 2Pk, TN7602PK", "asin": "B07YGL9XTH", "brand": "Brother International", "stars": "4.7", "reviewsCount": "872 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/51qcXV5b3gL._AC_SY355_.jpg", "breadCrumbs": ["Office Products", "›", "Office Electronics", "›", "Printers & Accessories", "›", "Printer Parts & Accessories", "›", "Printer Ink & Toner", "›", "Toner Cartridges"], "description": "Brother Genuine High-Yield Black toner cartridge twin pack TN760 2Pk contains two TN760 Black toner cartridges that deliver consistent, professional laser-quality prints you can rely on for up to 3, 000 pages per cartridge (1) for a total of up to 6, 000 pages.(1) the Brother Genuine laser toner 2-pack offers extra convenience – having an extra toner cartridge on hand and printing twice as many pages when you use both toner cartridges.(2) Brother Genuine laser toner is intelligently engineered to work seamlessly with your Brother printer to consistently deliver sharp, crisp laser-quality prints that withstand the test of time. Using Brother Genuine multi-pack laser toner offers convenience and helps minimize the number of repeat toner orders you need to place. Brother offers an environmentally responsible way for customers to dispose of Brother Genuine cartridges. Visit manufacturer's website to learn more. Brother Genuine High-Yield Black toner cartridge twin pack TN760 2Pk is for use with: DCP-L2550DW, HL-L2350DW, HL-L2370DW, HL-L2370DW XL, HL-L2390DW, HL-L2395DW, MFC-L2710DW, mfc-l2717dw, MFC-L2750DW, MFC-L2750DW XL. (1) Approximate toner cartridge yields in accordance with ISO/IEC 19752 (Letter/A4).(2) approximate toner cartridge yield for TN760 is up to 3, 000 pages per cartridge for a total of up to 6, 000 pages for two cartridges.", "price": {"value": "144.98", "currency": "$"}, "url": "https://www.amazon.com/Brother-Genuine-High-Yield-Black-Cartridge/dp/B07YGL9XTH/ref=sr_1_50?qid=1684829542&s=computers-intl-ship&sr=1-50"}