{"title": "SAMSUNG PRO Plus + Adapter 512GB microSDXC Up to 160MB/s UHS-I, U3, A2, V30, Full HD & 4K UHD Memory Card for Android Smartphones, Tablets, Go Pro and DJI Drone (MB-MD512KA/AM)", "asin": "4.8\n10,932 ratings\n4.8 out of 5 stars", "brand": "128 GB", "stars": "4.8", "reviewsCount": "10,932 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71t0S9EbMuL._AC_SX450_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Computer Accessories & Peripherals", "›", "Memory Cards", "›", "Micro SD Cards"], "description": "Your new go-to card + adapter combo, the Micro SD PRO Plus + Adapter makes capturing seamless 4K video on compatible phones or drones a breeze. Plus, the expanded storage provides you the freedom to play more high performance and intensive games on your tablet or gaming device. It’s all the extra space you need from a brand you can count on. ¹Requires a compatible phone or drone capable of filming 4K video. ²Comparisons based on 2020 PRO Plus microSD models. *The foregoing read & write speed performance is based on testing of 512GB capacity under standard conditions; Actual speeds may vary depending upon card capacity; **Stated performance is achieved by using PRO Plus microSD cards with Samsung adapters, ³Waterproof: withstand up to 72 hours in seawater; ⁴Temperature proof: operating temperatures of -25 C to 85 C; non-operating temperatures of -40 C to 85 C; ⁵X-Ray Proof: up to 100mGy, equal to airport X-ray machines; ⁶Magnetic-Proof up to 15,000 gauss, or the magnetic field equivalent of a high-field MRI; ⁷Drop: withstand drops up to 5meters (16.4 feet). ⁸Wearout: up to 10,000 swipes. ⁹Source: 2003-Q3 2020 IHS Markit data: NAND suppliers' revenue market share.", "price": {"value": "42.99", "currency": "$"}, "url": "https://www.amazon.com/SAMSUNG-Adapter-microSDXC-MB-MD512KA-AM/dp/B09B1HYPR9/ref=sr_1_49?qid=1684829542&s=computers-intl-ship&sr=1-49"}