{"title": "Chemical Guys CWS_201_16 Microfiber Cleaning Cloth & Car Wash Towel Concentrated Cleaning Detergent, 16 fl oz, Orange Scent", "asin": "B001TJXWH4", "brand": "Orange", "stars": "4.6", "reviewsCount": "4,933 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71xfzz25dBS._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Car Care", "›", "Exterior Care", "›", "Car Wash Equipment", "›", "Cleaners"], "description": "Chemical Guys Microfiber Wash is a specialty detergent that cleans and restores microfiber. The advanced cleaning formula releases dirt, grease, and residue, leaving microfiber feeling like new. Microfiber Wash maintains the original condition of microfiber by gently cleaning the fabric to preserve its softness. Microfiber Wash removes wax, polish, dirt, grease, and stains, and leaves microfiber goods with a fresh scent. The versatile microfiber detergent can be used by hand or in any washing machine. Microfiber Wash is concentrated to easily clean and restore even the dirtiest microfiber. The innovative wash solution gently cleanses the microfiber of dirt and grime while restoring the soft feel back to any microfiber towel. Quickly and easily clean microfiber towels, clothing, bedding, and upholstery using the versatile cleaning detergent. Chemical Guys Microfiber Wash is the perfect detergent to clean and rejuvenate microfiber goods. The advanced cleaning solution removes dirt, stains, grease, wax, and grime from microfiber. Microfiber Wash restores microfiber towels back to original condition by releasing dirt and oil from the fabric for a soft feel. Citrus-based detergents penetrate each individual fiber for maximum cleaning results. While typical detergents stay locked inside cloth and garments, Microfiber Wash rinses completely clean for a perfectly-soft, residue-free towel. Microfiber Wash contains no bleach, no fabric softeners, and is safe on all color microfiber goods. Easily clean and rejuvenate microfiber towels, blankets, sheets, bedding, and clothing with fantastic results. Microfiber Wash opens the billions of strands inside microfiber fabric to gently release dirt and grime. Microfiber towels require special cleaning, and Microfiber Wash is specifically designed to clean sensitive microfiber goods. Microfiber Wash contains water softeners that Balancedize minerals and calcium to ensure your microfiber goods rinse perfectly clean and soft.", "price": {"value": "9.99", "currency": "$"}, "url": "https://www.amazon.com/Chemical-Guys-CWS_201_16-Microfiber-Concentrate/dp/B001TJXWH4/ref=sr_1_125?qid=1684811474&s=automotive-intl-ship&sr=1-125"}