{"title": "SAKURA Pigma Micron Fineliner Pens - Archival Black and Colored Ink Pens - Pens for Writing, Drawing, or Journaling - Black and Colored Ink - 05 Point Size - 8 Pack", "asin": "B0035I77IM", "brand": "Sakura of America", "stars": "4.8", "reviewsCount": "1,475 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/819ScuAEcWL._AC_SY355_.jpg", "breadCrumbs": ["Office Products", "›", "Office & School Supplies", "›", "Writing & Correction Supplies", "›", "Pens & Refills", "›", "Calligraphy Pens"], "description": "When accuracy, minute details and preservation count, the unparalleled archival quality of pigma micron pens makes them everyone's first choice. Artist, writers and illustrators reach for pigma micron and know their work is safeguarded with the permanence of pigma ink. Experience smooth, skipfree writing and crisp ink colors that leave consistent lettering and lines every time. It has achieved universal appeal and is carried by technical professionals, artists and crafters alike anthropologists, entomologists, scientists, research laboratories, archivists, architects, professional diamond cutters, cartoonists, manga and anime artists, illustrators, heirloom quilters and decorative fabric artists. Features archival quality ink for use in acidfree environments, chemically stable, waterproof, fade resistant, no smears, feathers or bleedthrough on most papers. Applicable for graphic art, scrapbook, archival recording, pen and ink illustrations, freehand art, rubber stamps, cartooning and fabric design. Technical qualities are archival quality pigma ink, six point sizes, no smear or feather when dry, waterproof and chemical proof, fade resistant, does not bleed through most papers, meets astm and acmi nontoxicity standard and not evaluated for cosmetic use on skin. Set comes with 8 different pieces having black, red, blue, green, brown, purple, sepia and rose colors.", "price": {"value": "10..99", "currency": "$"}, "url": "https://www.amazon.com/Sakura-30066-Micron-Blister-Colors/dp/B0035I77IM/ref=sr_1_826?qid=1684768926&s=arts-crafts-intl-ship&sr=1-826"}