{"title": "TheraBreath Fresh Breath Dentist Formulated Oral Rinse, Icy Mint, 16 Fl Oz (Pack of 2)", "asin": "B00IRKRK9O", "brand": "Church & Dwight - TheraBreath", "stars": "4.7", "reviewsCount": "77,732 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71LWVefWE+L._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Men's Grooming", "›", "Oral Care", "›", "Mouthwash & Breath Fresheners"], "description": "Praised for its ability to attack and eliminate embarrassing breath odor, the patented TheraBreath formula in Fresh Breath Oral Rinse uses the power of oxygen to target bad-breath-causing bacteria deep below the surface of the tongue and at the back of the throat. This refreshing, alcohol-free antibacterial cleanser rinse doesn't burn or sting, so it’s easy to use every day. TheraBreath Icy Mint Oral Rinse is certified kosher, gluten-free and vegan. It is also free of dyes, perfumes, detergents, and other harsh additives that can dry or damage the mouth. TheraBreath Fresh Breath Oral Rinse is our flagship product and has been dentist- and pharmacist-recommended for more than 20 years. TheraBreath Fresh Breath Oral Rinse is an ADA approved product and has become one of the United States' best-selling speciality oral hygiene treatments. Fresh Breath Oral Rinse by Dr. Katz attacks sulfur-producing bacteria, morning breath, and food odor. In fact, clinical studies have verified that TheraBreath is extremely effective at attacking bad breath odor for up to 24 hours. This powerful mouthwash eliminates even the most severe cases of bad breath or halitosis (which is the scientific name for this condition). Dr. Katz’s proven oral rinse formula does not contain alcohol, artificial flavors, or colors. It is also pH-balanced to maintain a non-acidic environment in the mouth, which reduces burning and enamel erosion, while preventing tooth sensitivity. This product is safe to use twice daily and is available without a prescription. This product is sold as a pack of two 16-ounce bottles and is also available in a Mild Mint flavor that is easy on sensitive teeth and gums. As with all our products, TheraBreath Fresh Breath Oral Rinse is guaranteed to work to your satisfaction, or your money back!", "price": {"value": "15.34", "currency": "$"}, "url": "https://www.amazon.com/TheraBreath-Fresh-Breath-Rinse-Bottle/dp/B00IRKRK9O/ref=sr_1_7?qid=1684824080&s=beauty-intl-ship&sr=1-7"}