{"title": "Master Magnetics - B005HY9KDM Magnet Sheet, Magnetic Paper, 12\" Wide, 24\" Long, White Vinyl Back, 08505", "asin": "B005HY9KDM", "brand": "Magnet Source", "stars": "4.3", "reviewsCount": "2,819 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61yuolv0I1L._SX425_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Craft Supplies", "›", "Adhesives", "›", "Adhesive Sheets & Sprays", "›", "Adhesive Sheets"], "description": "Did you know that the whole earth is like a giant magnet? Liquid metals found in the deep core of the earth create convection currents that create magnetic forces found all over the earth’s surface. Here at Master Magnetics, we specialize specifically in magnets and the different ways that magnets can be used to improve different aspects of life. Master Magnetics was founded in 1976 and is currently located in Castle Rock, Colorado. We manufacture and distribute magnetic products for commercial, industrial, and consumer use. We also have two exclusive distribution facilities located in California and Florida and another regional production and distribution facility located in Ohio. Our local production and distribution facilities allow us to create and ship magnetic products in a short amount of time and for a low price. This blank vinyl magnetic sheet is the perfect canvas for so many projects. It can be cut into smaller shapes or used as one big sheet. The magnets can endure in temperatures between 0 and 150 degrees fahrenheit. The whole sheet is 12 inches wide, 24 inches long, and 1/32 of an inch thick. You can even cut the sheet with scissors or a craft knife. Because of the large and flexible design, this magnetic sheet is ideal for photo displays, puzzles, or other craft projects. It’s also incredibly easy to apply. Allow the roll to reach room temperature before unrolling. Then, unroll the magnet and stick it on a flat, magnetic surface for a few hours to flatten it. Do not try to bend the magnet backwards to get rid of the curl. The vinyl front means that the sheet can be written on with wet-erase markers to be used as a memo board. Screen print inks are compatible with the vinyl front if you choose to print on the magnetic sheet. You or your child can decorate the sheet with acrylic or fabric paint, markers, lace, fabric, and so many more things. If you can dream it, you can make it!", "price": {"value": "18.07", "currency": "$"}, "url": "https://www.amazon.com/Master-Magnetics-Magnet-Magnetic-08505/dp/B005HY9KDM/ref=sr_1_854?qid=1684768936&s=arts-crafts-intl-ship&sr=1-854"}