{"title": "Swingline 3-Hole Punch, Desktop Puncher for Binder, 20 Sheet Punch Capacity, SmartTouch, Black/Silver (74133)", "asin": "B00AFTQ4X8", "brand": "Metal", "stars": "4.8", "reviewsCount": "5,879 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/51a-LCD1jIL._AC_SY355_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Paper & Paper Crafts", "›", "Punches"], "description": "The Swingline SmartTouch 3-Hole Punch is a strong choice for consistent hole punching, with metal construction and an edge guide for precise punch alignment. The wide, comfortable, soft grip handle makes it easier to punch and locks in closed position for easy storage. Low force punch requires 50 percentage less effort to operate than standard punches, and cuts through paper with minimal effort on the part of the user. Pierces through up to 20 sheets of paper, cutting clean 9/32” holes. Cleanup of punched holes is simple with a convenient opening built into the base. The hole pattern in the base allows the user to see when the chip tray is full. Swingline backs this high-quality punch with a limited 1-year warranty. Ideal for everyday use, the SmartTouch paper punch makes it up to 50 percentage easier to take care of all your hole punch tasks. SmartTouch is a reduced effort punch with an ergonomic handle. Soft grip material over durable metal construction makes manual operation even more comfortable and ensures long-lasting use. Great for any busy office worker, this punch comes in two models to 3-hole punch either 12 or 20 sheets at a time, depending on your needs. The resulting 9/32\" holes with be perfectly spaced to easily insert sheets into a 3-ring binder or presentation folder. Plus, a convenient hole pattern on the punch base allows you to clearly see when the chip tray has gotten full. The base of the punch is removable to allow you to quickly and easily empty the chip tray while keeping your workspace neat and clean. A 2-hole version of the SmartTouch paper punch is also available. It's nearly twice as easy to punch papers with SmartTouch. Available in a 12 sheet punch capacity and 20 sheet punch capacity version, these reduced effort 3-hole punches are packed with user-friendly features. Perfect for any office worker a SmartTouch hole punch is convenient, functional and simple. Swingline paper punches deliver clean punch results from the convenience of your desktop. Choose a hole punch that matches your style and meets your needs. SmartTouch 3-Hole Punch--It is up to 50 percentage easier to punch with SmartTouch than with a standard paper punch. Packed with easy-to-use features such as a soft grip handle that locks down for storage and a viewable chip tray, this hole punch is perfect for any office worker. Durable metal construction, choose 12 or 20 sheet punch capacity. SmartTouch 2-Hole Punch--The SmartTouch 2-hole punch makes it 50 percentage easier to hole punch as many as 20 sheets at a time. Fixed punch heads punch two 9/32\" holes. Additional features include durable metal construction, a soft grip handle, chip tray, extendable paper guide and built-in ruler and edge guide. Optima Desktop Punch--Optima Desktop is a manual punch that is easy to use thanks to reduced effort design. Punches up to 25 sheets using 50 percentage less effort than with a traditional punch. Created 2 or 3 holes and features a spill-resistant chip tray. Handle locks down for convenient storage.", "price": {"value": "19.80", "currency": "$"}, "url": "https://www.amazon.com/Swingline-A7074133-SmartTouch-Sheets-Capacity/dp/B00AFTQ4X8/ref=sr_1_962?qid=1684768988&s=arts-crafts-intl-ship&sr=1-962"}