{"title": "Sugru by Tesa - All Purpose Super Glue, Moldable Craft Glue for Indoor & Outdoor - Adhesive Glue for Creative Fixing, Repairing, Bonding & Personalizing - 8 Pack - White (3.5g/ea)", "asin": "B089WJ1KF9", "brand": "Sugru Inc.", "stars": "4.5", "reviewsCount": "5,225 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71kX1NRDXUL._SX342_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Craft Supplies", "›", "Adhesives", "›", "Art Glues & Pastes"], "description": "What is Sugru Moldable Glue? Say Hello to Sugru by tesa! The moldable glue turns into a durable and flexible silicone rubber. Thanks to its Advanced Silicone Technology, Sugru sticks to lots of different materials.This is how Sugru Moldable Glue works:Out of the pack, Sugru is soft and malleable, just like play-dough. Roll the material in your fingers, press it where you need it, and mold it into any shape. You have 30 minutes to repair, bond, seal, mount, modify, create, decorate, improve, upcycle, even personalize – enough time to reposition and make perfect. If you change your mind? You can remove Sugru from non-porous surfaces by using a knife or scalpel.What can Sugru be used for?There are no limits to what you can do with this versatile easy to use repair putty. Sugru is the best glue for tool-free, everyday fixing, including like-new invisible repairs, handicrafts, and DIY projects.You can use Sugru to fix frayed charger cables and broken zippers, re-attach and rebuild missing parts on things like pot lids, cutlery, or toys. You can also make stuff scratch-proof, like making protective rubber feet for chairs or restore the seals on fridges or dishwashers. Thanks to the non-toxic, mess-free material you can also use Sugru together with your children over the age of three.But that’s not all: Thanks to its robust UV and rain/humidity resistance, Sugru is perfect for making improvements around the house, indoors and outdoors. Whether it’s for fixing and making in the garden or sealing leaky hiking boots, Sugru scores with its weatherproof and waterproof features. It can also withstand challenging indoor environments like wet bathrooms or kitchen sink areas. Sugru is temperature-resistant and extremely strong too, one single-use pack can hold up to 4.4lb, making it ideal for mounting without drilling. When do you start your project?Be careful with electricity. Stick to small consumer electronics repairs, low current and below 24 volts.Depending on the thickness of the application, for load-bearing projects, allow up to 48 hours for Sugru to fully set.", "price": {"value": "17..96", "currency": "$"}, "url": "https://www.amazon.com/Sugru-I000954-Moldable-Multi-Purpose-Creative/dp/B089WJ1KF9/ref=sr_1_608?qid=1684768829&s=arts-crafts-intl-ship&sr=1-608"}