{"title": "Springhill 8.5” x 11” Blue Colored Cardstock Paper, 67lb Vellum Bristol, 147gsm, 250 Sheets (1 Ream) – Premium Lightweight Cardstock, Vellum Printer Paper with Textured Finish – 026000R", "asin": "B009ZMIP8I", "brand": "Sylvamo", "stars": "4.7", "reviewsCount": "3,699 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71dp+PDk5PL._AC_SY355_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Paper & Paper Crafts", "›", "Paper", "›", "Card Stock"], "description": "When you need a premium lightweight cardstock paper, this Springhill colored cardstock is the go-to-choice. With a blue shade and a textured paper finish, this 67lb Vellum Bristol cardstock is designed for bleed-free, dual-sided print and copy use on all copiers, laser printers and inkjet printers that accept this cover cardstock weight. Consult your home printer manual before ordering to make sure it can handle this text weight or cover weight colored paper you have selected. Use this textured cardstock paper for any project in your home, business, or classroom that requires a strong, printable cardstock paper that can be die-cut, stamped or folded. It’s ideal for black and white printing, color printing, direct mail, greeting cards, tent cards, announcements, menus, brochures, and many other applications. The toothy paper surface results in crisp, vibrant prints and minimal show-through whether you’re printing personal or commercial print projects. 67lb Vellum Bristol meets USPS regulations, so you can use it for mailings. Plus, this acid-free cardstock prevents your documents from yellowing over time. Springhill is 100% made in the USA and Sustainable Forestry Initiative (SFI) certified which means when you buy Springhill paper, you're purchasing a renewable resource. At International Paper we're committed to helping replant forests, sustain forestlands, and contribute to healthy forest ecosystems. Choose Springhill Cardstock - the perfect choice medium for printer ink, colored pencils, markers, crayons, watercolors, and more.", "price": {"value": "15.82", "currency": "$"}, "url": "https://www.amazon.com/Springhill-Colored-Cardstock-147gsm-Sheets/dp/B009ZMIP8I/ref=sr_1_799?qid=1684768913&s=arts-crafts-intl-ship&sr=1-799"}