{"title": "Huggies Little Movers Baby Diapers, Size 5 (27+ lbs), 120 Ct", "asin": "B08QR8X2N5", "brand": "Kimberly-Clark Corp.", "stars": "4.8", "reviewsCount": "23,006 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81ehyfN1uXL._AC_SX425_PIbundle-2,TopRight,0,0_SH20_.jpg", "breadCrumbs": ["Baby Products", "›", "Diapering", "›", "Disposable Diapers"], "description": "Designed with your active baby in mind, Huggies Little Movers Baby Diapers are our best fitting diaper! Offering up to 12 hours of comfortable protection, each Little Movers baby diaper features a curved shape and a stretchy waistband designed to prevent leaks and help keep your baby comfortable while on the move. Double Grip Strips provide flexibility and help eliminate gaps for worry-free running, jumping and playing while a soft, back pocketed waistband helps avoid diaper blowouts. These disposable baby diapers also have a fast-absorbing DryTouch Liner and lock away 99% of wetness to help keep skin dry. These Huggies diapers are extra soft and contoured around the legs to help provide red-mark free, gentle protection. Plus, a wetness indicator easily lets you know when your baby is ready for a diaper change. Not only are Little Movers safe for sensitive skin, hypoallergenic and dermatologist-tested, but they're also free of fragrances, lotions, parabens, elemental chlorine and natural rubber latex. Showcasing limited edition Disney's The Lion King designs to celebrate 100 years of Disney, Little Movers Diapers are available in size 3 (16-28 lbs), size 4 (22-37 lbs), size 5 (27+ lbs), size 6 (35+ lbs) and size 7 (41+ lbs). Don't get caught without Huggies diapers! Sign up for Subscribe & Save to ensure you always have Little Movers on hand. Join Huggies Rewards+ powered by Fetch to get rewarded. Earn points on Huggies diapers and wipes, in addition to thousands of other products to redeem for hundreds of gift cards. Download the Fetch Rewards app to get started today! (*Wet Fit, Among Branded Open Diapers)", "price": {"value": "52.98", "currency": "$"}, "url": "https://www.amazon.com/Baby-Diapers-Huggies-Little-Movers/dp/B08QR8X2N5/ref=sr_1_36?qid=1684817442&s=baby-products-intl-ship&sr=1-36"}