{"title": "Chemical Guys CWS_104_16 Concentrated Bug and Tar Remover Car Wash Soap (Works with Foam Cannons, Foam Guns or Bucket Washes) Safe for Cars, Trucks, Motorcycles, RVs & More, 16 fl. Oz", "asin": "B003Y9N2E0", "brand": "Chemical Guys", "stars": "4.5", "reviewsCount": "6,055 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81WLLpk135S._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Car Care", "›", "Exterior Care", "›", "Car Polishes & Waxes", "›", "Bug, Sap & Tar Removers"], "description": "Bug & Tar Remover is a heavy-duty cleaner that safely washes bugs and tar from any vehicle. Bug guts are some of the worst things for automotive paint. Flying insects contain corrosive chemicals that permanently damage paint if left unchecked. The concentrated Bug & Tar formula breaks down the most stubborn dried bugs and tar residue to save the surface from permanent damage. The special formula is safe on bumpers, windshields, headlights, plastics, chrome, grilles, painted surfaces, and more. Simply add 1 - 3 oz. Of Bug & Tar Remover to the normal soap in the car wash bucket to remove dried bugs and grime. For spot treatment, dilute Bug & Tar Remover 6: 1 in a spray bottle, spray on the surface, then gently wipe away nasty bugs with a premium microfiber towel. Bug & Tar Remover is safe for Clear coat and single stage paint finishes, and removes heavy bugs without damaging paintwork. The versatile formula breaks down grease, tar, dried bugs, road Film, insects, and asphalt. The last thing you want to do is use a rough brush or mitts to remove them as this only induces more damage. Bug & Tar Heavy Duty Car Wash Shampoo will remove these bugs with ease along with other fluids, oil and tar spots. Bug & Tar Remover reduces the amount of scrubbing needed to remove bugs and grime, which further reduces the chances of installing swirl marks and scratches while washing. Wash away bugs, tar and grime with Chemical Guys bug & tar Remover. This product can also be diluted to a lesser amount and sprayed directly onto specific areas such as the bonnet, lower half of the car and wheels, left for about 30 seconds then hosed down, making the whole wash process much easier.", "price": {"value": "11.99", "currency": "$"}, "url": "https://www.amazon.com/Chemical-Guys-CWS_104_16-Heavy-Shampoo/dp/B003Y9N2E0/ref=sr_1_98?qid=1684811464&s=automotive-intl-ship&sr=1-98"}