{"title": "Chemical Guys CLD_201_16 Signature Series Orange Degreaser, Multipurpose Power, Safe for Cars, Trucks, SUVs, Motorcycles, RVs & More, 16 fl oz", "asin": "B00DZI39UW", "brand": "Chemical Guys", "stars": "4.6", "reviewsCount": "4,859 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71R07jXfqJS._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Oils & Fluids", "›", "Cleaners", "›", "Engine Cleaners & Degreasers", "›", "Degreasers"], "description": "Chemical Guys Signature Series Orange Degreaser is designed to loosen and emulsify grease, oil, dirt, and grime. The all-new professional grade degreaser is perfect for cleaning engines, machinery, tools, tires, wheels, and floors. Chemical Guys engineered Signature Series Orange Degreaser with the cleaning power of citrus to break down the toughest grease and grime. The multipurpose power of the Signature Series Orange Degreaser is extremely versatile in any situation. Chemical Guys uses professional strength cleaning power to get the job done. Detailing professionals around the world choose Chemical Guys Signature Series Orange Degreaser for the toughest jobs. Chemical Guys Signature Series Orange Degreaser is formulated to remove the toughest grease and grime. The professional strength formula is super concentrated for ultimate versatility. Simply dilute Signature Series Orange Degreaser to the desired ratio and remove nasty dirt, grease, stains, and grime from your car, truck, motorcycle, boat, and even RV. Spray down your car's dirty engine bay to remove years of built-up grime and gunk for a fresh shine. Remove dirt and grime from your tires to restore the original black look. Clean and restore the shine back your wrenches, ratchets, and screwdrivers. Chemical Guys Signature Series Orange Degreaser is great at handling the toughest jobs that other generic degreasers can't handle. The all-new advanced citrus infused formula emulsifies the toughest grease and pulls it from the surface for a clean shine. Signature Series Orange Degreaser is perfect for removing heavy mud, dirt, and grime from your off-road and 4x4 vehicles. The powerful formula is great at cleaning greasy suspension and differential parts leaving every inch of your car or truck looking great all year round. Simply add a few ounces of the Signature Series Orange Degreaser to a bucket of water to mop and clean your dirty shop floor.", "price": {"value": "11.99", "currency": "$"}, "url": "https://www.amazon.com/Chemical-Guys-CLD_201_16-Signature-Degreaser/dp/B00DZI39UW/ref=sr_1_226?qid=1684811516&s=automotive-intl-ship&sr=1-226"}