{"title": "EarMaster 7 Professional - Ear Training, Sight-Singing, Rhythm Trainer", "asin": "eMedia", "brand": "January 1, 2018", "stars": "3.4", "reviewsCount": "18 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71VJnd13m1L._AC_SX679_.jpg", "breadCrumbs": ["Software", "›", "Music", "›", "Music Notation"], "description": "Do you want to become a better musician? Or do you need to pass a music theory exam? You found the right software! EarMaster is the #1 music theory trainer for all musicians who want to improve their skills, from beginner level to the very advanced musician. With more than 2500 interactive lessons, EarMaster covers all the core aspects of ear training, sight singing, and rhythm training. You will learn to: sight-sing melodies off musical scores, sing back melodies you just heard, clap back rhythms you just heard, sing on pitch, transcribe music by ear, play in rhythm and with precise timing and recognize chords, intervals, scales and cadences by ear. Most musicians want to improve their music theory skills but let's be honest, it's neither the easiest or the most exciting part of music learning. It requires a lot of time, dedication, consistency and also a devoted training partner. That's exactly why we created EarMaster: to make music theory easy, motivating and fun to learn. It's so efficient that you will make solid, lasting progress within the first few weeks of use! Developed in close partnership with music theory experts from several universities, EarMaster enables you to improve your skills with the exact same exercises that you would meet in the best music schools - but don't take out word for it: EarMaster is also used by thousands of music schools around the world to accompany music theory courses at most teaching levels. So if you are serious about your musical skills, don't waste one more minute and get started with EarMaster, because if you can hear it, you can play it! Includes free update to version 7.1 with the following features: Microphone input for rhythm clapping; 400+ classical scores added for ear training and sight-singing practice with works by Bach, Mozart, Monteverdi, Haydn, and more; MusicXML import supports dynamics for smoother playback; Czech translation; and hundreds of under-the-hood improvements and fixes.", "price": {"value": "49.95", "currency": "$"}, "url": "https://www.amazon.com/EarMaster-Professional-Training-Sight-Singing-Trainer/dp/B0793H25P1/ref=sr_1_99?qid=1685339128&s=software-intl-ship&sr=1-99"}