{"title": "Chemical Guys CWS20916 Swift Wipe Sprayable Waterless Car Wash, Easily Clean - Just Spray & Wipe, Safe for Cars, Trucks, Motorcycles, RVs & More, 16 fl. Oz", "asin": "B079JY1HDJ", "brand": "Chemical Guys", "stars": "4.7", "reviewsCount": "4,354 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/716jSCUIviL._AC_SY355_.jpg", "breadCrumbs": ["Automotive", "›", "Car Care", "›", "Exterior Care", "›", "Car Wash Equipment", "›", "Waterless Wash Treatments"], "description": "Chemical Guys Swift Wipe Waterless Car Wash is the next generation waterless detailing system. Swift Wipe Waterless Car Wash cleans, shines, and protects without installing any swirls or scratches. The waterless detailing system finishes with a coat of optical gloss enhancers to ensure your car is getting washed and pampered in one step. Chemical Guys Swift Wipe rapidly and safely lifts away dirt, dirt, and grime leaving behind a high-shine protective layer. Whether your gearing up for a car show or need a quick clean before heading out, Swift Wipe Waterless Car Wash makes washing your car fast and easy. Use Swift Wipe Waterless Car Wash on painted surfaces, wheels, glass, clear optical plastic, textured plastic, bumpers and window trim, exhaust tips, engine bays, door jambs, and more. Use Swift Wipe Waterless Car Wash on painted surfaces, wheels, glass, clear optical plastic, textured plastic, bumpers and window trim, exhaust tips, engine bays, door jambs, and more. Choose Swift Wipe Waterless Car Wash to have the latest innovation in waterless washing technology at your fingertips. Swift Wipe Waterless Car Wash is formulated with slickening agents that provide lubrication on the surface of the vehicle for a fast, easy, Swift Wipe of dirt and contamination. Not only does Swift Wipe Waterless Car Wash provide a fast easy wash, but it leaves behind a non-stick UV protective coating on all vehicle surfaces for added protection against the elements. Keep a bottle in your trunk, bike, or motorcycle for trips and adventures. Make fast work of cleaning large surfaces like airplanes and RV’s as easy as a Swift Wipe. Now you can give your car the ultimate clean anywhere with Chemical Guys Swift Wipe Waterless Car Wash.", "price": {"value": "11.97", "currency": "$"}, "url": "https://www.amazon.com/Chemical-Guys-CWS20916-Waterless-Fluid_Ounces/dp/B079JY1HDJ/ref=sr_1_149?qid=1684811485&s=automotive-intl-ship&sr=1-149"}