{"title": "Cricut Explore Air 2 - A DIY Cutting Machine for all Crafts, Create Customized Cards, Home Decor & More, Bluetooth Connectivity, Compatible with iOS, Android, Windows & Mac, Mint", "asin": "Provo Craft & Novelty", "brand": "October 18, 2016", "stars": "4.8", "reviewsCount": "24,699 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/41K7CJa3kqL._SX342_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Scrapbooking & Stamping", "›", "Die-Cutting & Embossing", "›", "Die-Cut Machines"], "description": "Customizing cards, creating iron-on stickers for T-shirts, designing wall decor for home or office and much more becomes easy with the uber cute Cricut Explore Air 2 cutting machine, with double the speed than its predecessor, that precisely cuts all craft materials with simplicity. With wireless Bluetooth connectivity and a cloud-based app that works on Windows, Mac, iOS and Android systems, get access to thousands of customizable designs and templates to ace the DIY game. Delve into majestic creativity with this cutting, writing and foiling magic creator that is compatible with 6 tools (sold separately) exploring around 100+ materials to uniquely present your crafting skills. The tools work in line with popular craft materials like cardstock, vinyl, and HTV iron-on to specialty materials like glitter paper, cork, and Infusible Ink Sublimation Sheets Highlighting your detailed writing tips, creating pro-level foil embellishments, and scoring an ace would now become simpler with additional tools like Scoring Stylus, Foil Transfer Tool and Deep-Point Blade. The kit includes Premium Fine-Point Blade with its housing, a fine point black pen, a light-grip machine mat, a welcome book, USB cable, power adapter, 50 ready-to-make projects and a free trial membership to Cricut Access for new subscribers.", "price": {"value": "199.00", "currency": "$"}, "url": "https://www.amazon.com/Cricut-Explore-Air-2-Mint/dp/B01GSOMVRG/ref=sr_1_300?qid=1684768692&s=arts-crafts-intl-ship&sr=1-300"}