{"title": "Philips AVENT Fast Baby Bottle Warmer with Smart Temperature Control and Automatic Shut-Off, SCF358/00", "asin": "B0876T9DQZ", "brand": "6.3 x 6.89 x 7.29 inches", "stars": "4.5", "reviewsCount": "9,552 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/41DkTpyu0IL._SY450_.jpg", "breadCrumbs": ["Baby Products", "›", "Feeding", "›", "Bottle-Feeding", "›", "Bottle Warmers"], "description": "The Philips AVENT Fast Baby Bottle Warmer SCF358/00 is a safe and easy way to make mealtime more comfortable for baby. It gently heats a 5 ounce bottle in as few as 3 minutes. Milk circulates continuously while it's warming, so the warmer - unlike a microwave - won't cause hot spots. The warmer can be used not only to warm milk, but also to defrost frozen breast milk and baby food. It is compatible with all Philips AVENT bottles, bottles from most other leading brands, and baby food jars. The Philips Avent Fast Baby Bottle Warmer allows you to set it and forget it. Sensors automatically adjust the heating pattern for different milk volumes and starting temperatures, so the warmer hits the right temperature every time with the push of a button. It also keeps milk warmed to the desired temperature for up to 60 minutes. After 60 minutes it automatically shuts off to prevent overheating, giving you peace of mind if you get distracted or fall asleep after a late night feeding. The front panel is intuitive and easy to read with clear guidance on setting by milk volume for accurate results. A progress light lights up in three segments, indicating the warming progress and when milk is ready. The warmer is compact so it's easy to store on a kitchen counter or bedside table for nighttime feedings. Always test milk or food temperature before giving to babies. Warms 5 ounces of milk in 3 minutes. Voltage: 120 - 127 volts, 60 Hertz.", "price": {"value": "49.97", "currency": "$"}, "url": "https://www.amazon.com/Philips-Temperature-Control-Automatic-Shut-Off/dp/B0876T9DQZ/ref=sr_1_56?qid=1684817455&s=baby-products-intl-ship&sr=1-56"}