{"title": "Wahl Micro Groomsman Battery Personal Pen Trimmer & Detailer for Hygienic Grooming with Rinseable, Interchangeable Heads for Eyebrows, Neckline, Nose, Ears, & Other Detailing - 05640-600", "asin": "Wahl Clipper Corp", "brand": "043917564067", "stars": "4.1", "reviewsCount": "36,363 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61lY7VnpKqL._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Shave & Hair Removal", "›", "Men's", "›", "Beard & Mustache Care", "›", "Beard & Mustache Trimmers"], "description": "Wahl’s 2-in-1 Micro Groomsman is the complete kit that will meet all your styling and grooming needs. Perfect for trimming beards, nose, and ear hair, we’ve thought of everything you could need to recreate your favorite styles every time at home, traveling, or on the go! The Wahl Lithium 2 in 1 Pen Trimmer includes Detailer Head, Rotary Head, Eyebrow Guide, Protective Cap, & English & Spanish Instructions. Our micro detailer features superior blades, rugged anodized aluminum housing, with enough performance, power, & run time to achieve the perfect look on the go or at home. Perfect for facial hair detailing with the Detailer Head; Perfect for any area needing light hair removal such as nose, ear, brow, sideburn, toes, & touch-ups on the neckline. To change out the battery simply remove cap, hold trimmer body with one hand and pinch the trimmer head with your index finger and thumb with the other hand then gently pull up on the trimmer head. This will give you access to the battery tray. Replace bad battery and simply slide trimmer back into the metal sleeve. To remove the trimmer head pinch the head between your index finger and thumb then turn counterclockwise a quarter turn and lift away from the trimmer body. To replace the head, align the notches on the head with the channel on the trimmer bod, press down and turn a quarter turn clockwise until it locks into place. Wahl clippers & trimmers are available in a variety of styles to meet your home hair cutting needs. From Lithium-Ion cordless & rechargeable clippers to heavy-duty corded models, Wahl clippers & trimmers deliver a high-performance cut every time. Wahl clippers and trimmers have been used by professionals in the salon & barber industry since 1919. With self-sharpening precision blades & quality construction, Wahl clippers, shavers & trimmers deliver a smooth shave. Product in packaging may not be the same as photo due to continuous improvements to the product. Note: We test our trimmers for cutting performance prior to packaging with a hygienic fiber. We do our best to clean the product to remove any testing particles, but it is possible a few may remain. They are not hair and can be simply wiped off.", "price": {"value": "9.99", "currency": "$"}, "url": "https://www.amazon.com/Wahl-Groomsman-Rinseable-Interchangeable-Detailing/dp/B003TW70E0/ref=sr_1_152?qid=1684824147&s=beauty-intl-ship&sr=1-152"}