{"title": "READER RABBIT 1ST GRADE CAPERS ON CLOUD NINE", "asin": "B000EOQZV0", "brand": "16.19", "stars": "3.6", "reviewsCount": "13 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71XWD5fJjOL._AC_SX679_.jpg", "breadCrumbs": ["Software", "›", "The Learning Company", "›", "All"], "description": "Visit Cloud Nine with Reader Rabbit and Sam the Lion! It’s suddenly started raining wacky raingear, so let’s high-tail it to find out what’s up with the weather. With fun activities in spelling, math, vocabulary, and science, your forecast calls for a 100% chance of learning fun! Skills Learned: Math with counters Creating equivalent equations Using coins Spelling Reading comprehension Building vocabulary Letter blends & digraphs Rhyming words Sorting by attribute Extending patterns Picture animation Problem solving Creating music Features: Musical Marble Patterns Use colorful singing marbles to complete the pattern and unlock the mystery door! Amazing Art Gallery Create moving pictures and then display your masterpieces in the Amazing Art Gallery! Raingear Forest Math Can you help save the Raingear Forest? Plant a tree with every correct equation you create! Other Features Auto-adjusting skill levels Help is always available Progress tracing reports Printable activities Requirements: Windows 98, Me, 2000, XP, Vista 166 MHz Pentium or faster 32 MB RAM 100 MB free hard disk space 640x480 monitor, 16-bit color SoundBlaster compatible sound card & speakers (stereo recommended) 8X CD-ROM drive Internet access recommended Color printer recommended Mac OS 8.6–9.2, OS X PowerPC 180 MHz or faster 32 MB RAM 100 MB free hard disk space 640x480 monitor, thousands of colors 16-bit stereo sound 8X CD-ROM drive Internet access recommended Color printer recommended", "price": {"value": "15.69", "currency": "$"}, "url": "https://www.amazon.com/READER-RABBIT-GRADE-CAPERS-CLOUD/dp/B000EOQZV0/ref=sr_1_107?qid=1685339128&s=software-intl-ship&sr=1-107"}