{"title": "Ubbi Steel Odor Locking, No Special Bag Required Money Saving, Awards-Winning, Modern Design, Registry Must-Have Diaper Pail, White", "asin": "May 10, 2012", "brand": "baby-unisex", "stars": "4.6", "reviewsCount": "7,535 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/617gsvCja+L._AC_SY741_.jpg", "breadCrumbs": ["Baby Products", "›", "Diapering", "›", "Diaper Pails & Refills", "›", "Diaper Pails"], "description": "The Ubbi Steel Diaper Pail is made of powder-coated steel to achieve maximum odor control. It is equipped with rubber seals that are strategically designed to lock in odors as well as a sliding lid that minimizes air disruption, keeping the smell inside the pail. To meet the needs of today's parents, this award-winning nursery essential offers the convenience and value of utilizing any standard trash bag or reusable cloth liner. This feature makes it the easiest disposal system to load, use, empty and clean. Offering a modern and sophisticated twist to a once very industrial product, the sleek Ubbi diaper pail includes a child-proof lock and is available in an array of colors. All the style and none of the smell - a promising solution for every nursery. Enter the world of Ubbi where innovative products are designed and created with parents and children in mind. Under the Ubbi name, you will find unique, quality products that are easy to use, helping to simplify parents’ lives while keeping babies as happy and safe as can be. Thanks to its award-winning can of steel, Ubbi is now a recognized brand worldwide. The Ubbi diaper pail is renowned for its ability to achieve maximum odor control and appreciated for offering the convenience and value of utilizing any standard trash bag or reusable cloth liner, a breakthrough in the diaper disposal market. With the same customer focused philosophy and innovative design capabilities, the Ubbi brand is now expanding its signature diapering selection and extending into the feeding category. A wide range of Ubbi branded products is now available for today’s modern parents that are looking for stylish and functional baby essentials. From concept to final creation, the Ubbi team works together every step of the way to bring the best in design and value. The input of every member of the team is taken into account in the development of the Ubbi products, but consumer input is the most important as customer satisfaction is our primary goal.", "price": {"value": "69.99", "currency": "$"}, "url": "https://www.amazon.com/Ubbi-Required-Awards-Winning-Registry-Must-Have/dp/B00821FLT4/ref=sr_1_123?qid=1684817487&s=baby-products-intl-ship&sr=1-123"}