{"title": "Graco Premium Foam Crib & Toddler Mattress – GREENGUARD Gold Certified, CertiPUR-US Certified Foam, Machine Washable, Water-Resistant and Removable Cover, Fits Standard Full-Size Crib and Toddler Bed", "asin": "B010S7VZI0", "brand": "52 x 27.62 x 5 inches", "stars": "4.8", "reviewsCount": "43,620 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61LDqg9OgSL._SY606_.jpg", "breadCrumbs": ["Baby Products", "›", "Nursery", "›", "Bedding", "›", "Mattresses", "›", "Crib Mattresses"], "description": "Introducing the Graco Premium Foam Crib & Toddler Mattress — America's #1 Crib Mattress (*Based on dollars sold, according to 2019-2021 market data compiled by The NPD Group). GREENGUARD Gold Certified, JPMA Certified, and features a CertiPUR-US Certified foam core. Proud recipient of the Parent Tested Parent Approved (PTPA) Seal of Approval, the 2020-2023 Women’s Choice Award for “9 out of 10 Customer Recommended Crib & Toddler Mattress” and is also a National Parenting Product Awards (NAPPA) winner. Features a removable mattress cover that’s both comfortably soft and water-resistant. For easier care, this zip-off mattress cover is machine-washable (machine wash in cold water on delicate cycle, hang to dry – do not place in dryer machine). The mattress’ foam core is perforated to allow for increased air flow without compromising on firmness. For optimal performance, unbox and allow your mattress to fully expand in a room temperature setting immediately upon delivery. Fits any standard full-size crib or toddler bed. Dimensions: Length (52.00 inches) x Width (28.00 inches) x Height (up to 4.5 inches); Weight (7 pounds). Mattress core (100% polyurethane foam). Mattress cover (100% polyester). Backed by a 6-year limited manufacturer’s warranty. Exclusively manufactured by Stork Craft Manufacturing (USA) Inc.", "price": {"value": "89.99", "currency": "$"}, "url": "https://www.amazon.com/Graco-Premium-Toddler-Mattress-White/dp/B010S7VZI0/ref=sr_1_29?qid=1684817442&s=baby-products-intl-ship&sr=1-29"}