{"title": "Rain-X 820147 WeatherBeater Wiper Blades, 26\" and 16\" Windshield Wipers (Set of 2), Automotive Replacement Windshield Wiper Blades That Meet Or Exceed OEM Quality And Durability Standards", "asin": "B084CZZYB5", "brand": "Rain-X", "stars": "4.6", "reviewsCount": "52,712 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/61YlCf6WEWL._AC_SY450_.jpg", "breadCrumbs": ["Automotive", "›", "Replacement Parts", "›", "Windshield Wipers & Washers", "›", "Wipers", "›", "Blades"], "description": "Rain-X, a recognized and respected name in wiper blades for almost 20 years, is committed to providing you with the confidence of improved driving visibility. For over 15 years, Rain-X WeatherBeater (the original WeatherBeater wiper blade) is still known and trusted for its quality, durability, and value. WeatherBeater has been designed to be a high-quality traditional wiper blade that meets or exceeds all original equipment manufacturers' standards for quality, durability, and construction. This conventional blade features a natural rubber squeegee, a classic galvanized steel frame, multiple pressure points, and embedded friction reducers. The natural rubber squeegee provides resistance to cracking and splitting caused by weather, windshield wiper fluid, and road salt. The galvanized steel frame provides long-lasting strength and durability while also preventing rust and corrosion. Multiple pressure points and embedded friction reducers enable even pressure distribution across the length of the blade and help provide a clean wipe. If you need additional help with determining the right wiper blade size for your car, reference our Blade Finder or Amazon's Confirmed Fit program. If you need help with installing your new wiper blades, installation videos can be found by scanning the QR code on the back of your wiper blade’s packaging.", "price": {"value": "22.99", "currency": "$"}, "url": "https://www.amazon.com/Rain-X-WeatherBeater-Wiper-Blade-Combo/dp/B084CZZYB5/ref=sr_1_129?qid=1684811474&s=automotive-intl-ship&sr=1-129"}