{"title": "eMedia Music Theory Tutor Complete (Vol 1 & Vol 2) - Learn at Home", "asin": "September 29, 2015", "brand": "AD02153", "stars": "4.2", "reviewsCount": "19 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81KUJn8Q0tL._AC_SX679_.jpg", "breadCrumbs": ["Musical Instruments", "›", "Studio Recording Equipment", "›", "Computer Recording", "›", "Software", "›", "Sound Editing"], "description": "eMedia Music Theory Tutor Complete includes over 430 engaging music theory lessons organized to teach the crucial musical elements of rhythm, melody, and harmony. Learn music theory by using images, audio, interactivity, and practical music theory examples. The complete music theory curriculum can take a student from basic music theory for beginners all the way to intermediate-to-advanced music theory. Start with learning how to read music, chord theory, scale construction, and basic chord progressions. Then advance to understanding the circle of fifths, chord substitution, chord progression theory, and cadence. Acting like a real instructor, the Intelligent Practice feature in the music theory software analyzes your responses and creates an individualized practice program to improve your weakest areas. Hum, sing, or play your instrument into the computer's microphone. The music theory software can listen as you tap in rhythms, sing back pitches to guess intervals, and interact with the lessons in a natural way. eMedia Music Theory Tutor Complete shows you when you match pitches correctly in a lesson and shows a chart of your progress as you move through the course. Gain confidence as you pass the music theory quiz at the end of each subject and ace tests at the end of every grade level. The music theory lessons found in eMedia Music Theory Tutor Complete will teach you the building blocks of music. Learn to hear musical keys, scales, intervals, chords, and rhythms “in your head,” to help you compose music (with or without an instrument), improvise solos, and learn songs by ear faster.", "price": {"value": "79.95", "currency": "$"}, "url": "https://www.amazon.com/eMedia-Music-Theory-Tutor-Complete/dp/B015UAM89K/ref=sr_1_83?qid=1685339122&s=software-intl-ship&sr=1-83"}