{"title": "Hammermill White Cardstock, 110 Lb, 8.5 x 11 Colored Cardstock, 1 Pack (200 Sheets) - Thick Card Stock, Made in the USA, 168380R", "asin": "B08DCF5B4P", "brand": "Sylvamo", "stars": "4.7", "reviewsCount": "3,920 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71U7YFMm7jL._AC_SY355_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Paper & Paper Crafts", "›", "Paper", "›", "Card Stock"], "description": "Hammermill 8.5” x 11” premium white cardstock is a thick 110lb cardstock paper that’s designed for print and copy use on copiers and laser printers. It’s heavy cardstock that’s ideal for direct mail, promotional items, business cards, menus, invitations, arts & crafts, certificates and more. Use it for all of your professional and heavy-duty printing paper needs. Our 99.99. 000 sheets using Hammermill copying paper on your high-speed digital printer or we will replace your Hammermill paper purchase. We test more than 13.5 million sheets of paper every year to make sure that each sheet is consistent. Then we test our papers on all kinds of printer and copier equipment to ensure that it will work for you, every time, on every machine. Did you know that you are helping to conserve and restore forests when you buy Hammermill paper? “It’s More Than Just Paper” to us and millions of sustainable forestry workers across America, including American family tree farmers. Hammermill printer papers are made with renewable resources from certified sustainably managed forests. We want our business to last for generations and that means taking good care of our environment. Make sure it's original Hammermill quality: look for “Ships from and sold by” at the top of the page, under the product title.", "price": {"value": "14.29", "currency": "$"}, "url": "https://www.amazon.com/Hammermill-White-Cardstock-Colored-Sheets/dp/B08DCF5B4P/ref=sr_1_459?qid=1684768765&s=arts-crafts-intl-ship&sr=1-459"}