{"title": "SAMSUNG 970 EVO Plus SSD 1TB NVMe M.2 Internal Solid State Hard Drive, V-NAND Technology, Storage and Memory Expansion for Gaming, Graphics w/ Heat Control, Max Speed, MZ-V7S1T0B/AM", "asin": "4.8\n49,415 ratings\n4.8 out of 5 stars", "brand": "1 TB Solid State Hard Drive", "stars": "4.8", "reviewsCount": "49,415 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71OYNmVRFhL.__AC_SY300_SX300_QL70_FMwebp_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Data Storage", "›", "Internal Solid State Drives"], "description": ">For intensive workloads on PCs and workstations, the Samsung 970 EVO Plus delivers ultimate performance powered by Samsung's NVMe SSD leadership. It is upgraded to be faster than the 970 EVO. It maximizes the potential of NVMe bandwidth for unbeatable computing that meets the needs of the most demanding tech enthusiasts and professionals. For performance that puts you in command, the 970 EVO Plus combines the next-gen PCIe Gen 3.0 x4 NVMe interface with the latest V-NAND technology to achieve fearless read/write speeds up to 3,500/3,300MB/s,* up to 53%** faster than the 970 EVO. Samsung’s advanced nickel-coated controller and heat spreader on the 970 EVO Plus enable superior heat dissipation. The Dynamic Thermal Guard automatically monitors and maintains optimal operating temperatures to minimize performance drops. Samsung Magician software will help you keep an eye on your drive. A suite of user-friendly tools helps keep your drive up to date, monitor drive health and speed, and even boost performance.\n \n *Performance may vary depending on SSD’s firmware version and system hardware & configuration. Performance measurements based on IOmeter 1.1.0. The write performances were measured with Intelligent TurboWrite technology being activated. The sequential write performances after Intelligent TurboWrite region are: 400 MB/s(250GB), 900 MB/s(500GB), 1,700 MB/s(1TB) and 1,750 MB/s(2TB). Test system configuration: Intel Core i7-7700K CPU @4.2GHz, DDR4 2400MHz 32GB, OS-Windows 10 Built 10240, Chipset–ASUS PRIME Z270-A. **Up to 53 percent performance increase for sequential write speed for 250GB version. ***TBW: Terabytes Written ****Warrantied TBW for 970 EVO Plus: 150 TBW for 250GB model, 300 TBW for 500GB model, 600 TBW for 1TB model, 1,200 TBW for 2TB model. 5-years or TBW, whichever comes first. For more information on the warranty, please find the enclosed warranty statement in the package.", "price": {"value": "54.99", "currency": "$"}, "url": "https://www.amazon.com/Samsung-970-EVO-Plus-MZ-V7S1T0B/dp/B07MFZY2F2/ref=sr_1_6?qid=1684829519&s=computers-intl-ship&sr=1-6"}