{"title": "TP-Link WiFi Extender with Ethernet Port, Dual Band 5GHz/2.4GHz , Up to 44% more bandwidth than single band, Covers Up to 1200 Sq.ft and 30 Devices, signal booster amplifier supports OneMesh(RE220)", "asin": "4.0\n95,756 ratings\n4.0 out of 5 stars", "brand": "802.11n, 802.11b, 802.11a, 802.11ac, 802.11g", "stars": "4.0", "reviewsCount": "95,756 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/4170I9VYmiL._AC_SY355_.jpg", "breadCrumbs": ["Electronics", "›", "Computers & Accessories", "›", "Networking Products", "›", "Repeaters"], "description": "RE220 expands your existing Wi-Fi coverage with next generation 11AC Wi-Fi technology. It works with any standard Wi-Fi router and creates stronger dual band connections in hard-to-reach areas, allowing you to enjoy seamless wireless coverage throughout your home or office. RE220 provides APS (Adaptive Path Selection), with APS, Dual band or tri-band range extender can dynamically select the best backhaul connection between 2.4/5G/5G2 to ensure RE to router have the best connection, and in such way maintain a better overall Wi-Fi performance. Comparable to NETGEAR AC750 Wi-Fi Range Extender (EX3700-100NAS) Maximum wireless transmission rates are the physical rates derived from IEEE Standard 802.11 specifications. Range and coverage specifications along with the number of connected devices were defined according to test results under normal usage conditions. Actual wireless transmission rate, wireless coverage, and number of connected devices are not d, and will vary as a result of 1) al factors, including building materials, physical objects and obstacles, 2) network conditions, including local interference, volume and density of traffic, product location, network complexity, and network overhead and 3) client limitations, including rated performance, location, connection quality, and client condition. Operating Temperature: 0°C to 40°C (32°F to 104°F).", "price": {"value": "17.99", "currency": "$"}, "url": "https://www.amazon.com/TP-Link-AC750-WiFi-Range-Extender/dp/B07N1WW638/ref=sr_1_38?qid=1685333533&s=electronics&sr=1-38"}