{"title": "Accent Opaque White 8.5” x 11” Cardstock Paper, 65lb, 176gsm – 250 Sheets (1 Ream) – Premium Medium Weight Smooth Cardstock, Printer Paper for Invitations, Menus, Business Cards – 188560R", "asin": "B01JGGQHPU", "brand": "Sylvamo", "stars": "4.7", "reviewsCount": "2,931 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71X-MjOFNTL._AC_SY355_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Crafting", "›", "Paper & Paper Crafts", "›", "Paper", "›", "Card Stock"], "description": "When you need a premium medium cardstock paper, this Accent Opaque white cardstock is the go-to-choice. Boasting a high bright-white shade compared to other cardstocks, Accent Opaque premium 65lb cover stock is ideal for your everyday print jobs. It has a smooth and durable finish that provides the strength necessary for easy and exceptional printing, folding, scoring, die-cutting, and perforating, so it’s a multipurpose paper for home, school, and office use. It is designed for print and copy use on personal and commercial equipment that accept cover weight paper, including copiers, laser printers, inkjet printers, and offset presses. Consult your home printer manual before ordering to make sure it can handle this cover weight white paper you have selected. With Accent Opaque, you're getting a smooth paper surface that results in crisp, vibrant prints and minimal show-through whether you're printing personal or professional print projects for your home, business, or classroom. This 65lb white cardstock is a premium uncoated sheet that helps make flesh tones more realistic and colors brighter and bolder. This smooth cardstock is ideal for invitations, greeting cards, catalogs, business cards, brochures, direct mail, table tent cards, posters, marketing materials, and more. The medium-heavy paper strength also makes it ideal for scrapbooking and crafting applications. Plus, you can rest assured this acid-free cardstock provides the added archival quality that extends the life of the documents. Accent Opaque is 100% made in the USA and Forest Stewardship Council certified (C014786), which means when you buy Accent paper, you're purchasing a renewable resource. At International Paper, we're committed to helping replant forests, sustain forestlands and contribute to healthy forest ecosystems. Choose Accent Opaque Cardstock - the perfect choice medium for printer ink, colored pencils, markers, crayons, watercolors and more!", "price": {"value": "11.49", "currency": "$"}, "url": "https://www.amazon.com/Accent-Opaque-Cardstock-Bright-Sheets/dp/B01JGGQHPU/ref=sr_1_100?qid=1684768608&s=arts-crafts-intl-ship&sr=1-100"}