{"title": "VELCRO Brand VEL-30768-AMS Wide Straps 1 in x 30 ft Roll | Cut to Length, Reusable Self-Gripping Tape | Bundle Poles, Wood, Pipes, Lumber, Garage Organization for Tool Handles Hoses, More | Black, 1in", "asin": "B09QH2NVM1", "brand": "VELCRO", "stars": "4.8", "reviewsCount": "1,197 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71mrTH7z0oL._AC_SY355_.jpg", "breadCrumbs": ["Industrial & Scientific", "›", "Adhesives, Sealants & Lubricants", "›", "Adhesive Tapes", "›", "Hook & Loop Strips"], "description": "Available in rolls for bigger projects, VELCRO Brand ONE-WRAP ties are perfect for organizing wires, cords, and cables and for bundling a wide range of materials and tools. Customize the length of your tie by cutting the hook and loop roll to size. Adjustable ONE WRAP ties are strong, reusable, and designed for heavier-duty indoor or outdoor use. VELCRO straps perform as cable straps, cord straps or tie straps, as well as for use as a bike wheel strap, tie down strap, or to bundle large items in a neat and organized group. Use as appliance cord wrapper or cord bundlers for appliances. These long VELCRO Brand cable ties are useful multi-purpose fastenders. Perfect for around the office, home or on the job, bundling straps can help secure or tie down lumber or poles, plant stakes or garden tools organization in the shed, hand tools brooms and a myriad of items can be secured and organized, also use as edge wrap. Spend a day working on your garage organization and storage, using VELCRO Brand double sided heavy duty straps. Reusable and double sided, these rolls of strong VELCRO Brand heavy duty hook and loop straps are available in wide widths which giving them additional strength and reliability for tough bundling jobs in the garage or shed, as well as peace of mind when used in cable management ties, cord bundlers and key projects at office or worksite. Quick, easy, and strong, VELCRO Brand ONE-WRAP Rolls are perfect for bundling a wide range of materials, cables and tools. Adjustable ONE-WRAP rolls are strong, reusable, and designed for heavy duty indoor or outdoor use. Great for computer, appliance, and electronics wire management and organization. Custom cut to length for handling any bundling job or big project.", "price": {"value": "11.91", "currency": "$"}, "url": "https://www.amazon.com/VELCRO-Brand-VEL-30768-AMS-Self-Gripping-Organization/dp/B09QH2NVM1/ref=sr_1_103?qid=1684768608&s=arts-crafts-intl-ship&sr=1-103"}