{"title": "Dial Complete Antibacterial Foaming Hand Soap Refill, Spring Water, 32 fl oz", "asin": "Dial Corporation", "brand": "798813032966 017000090269 787461078204 017000090276 787543847995 794628306377 799891016800 795871610556", "stars": "4.7", "reviewsCount": "15,052 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71ONoXPOFAS._SY355_.jpg", "breadCrumbs": ["Beauty & Personal Care", "›", "Skin Care", "›", "Body", "›", "Cleansers", "›", "Hand Wash"], "description": "As America's trusted brand for over 70 years, the Dial brand continues to deliver clean, healthy skin for you and your family with this Dial Antibacterial Spring Water Foaming Hand Wash Refill. Dial Refill bottles made with Social Plastic from Plastic Bank are eco-friendly and they hold the same Dial formulas that you can count on for clean. Social Plastic is recycled plastic that drives environmental, social, and economic impact. Dial will help save over 30 million plastic bottles in 2022 from entering the ocean in collaboration with Plastic Bank* . Dial will also help save over 6 MM pounds of carbon emissions in 2022 by using PCR for its refill bottles**. Dial Antibacterial Foaming Hand Soap kills 99.99% of bacteria encountered in household settings and is the #1 Dr. Recommended Antibacterial Hand Soap brand. Skin Smart formulas from Dial are created with moisturizing conditioners and gentle cleansers to give you a balanced clean and the confidence to embrace each day. The formulas are also free from parabens, phthalates, and silicones. This package contains one Dial Antibacterial Foaming Hand Wash, Spring Water, 32 fluid ounce refill bottle. Packaging may vary. *Projected based on shipments over the 52 week period ending 9/1/21 **Projected based on shipments over the 52 week period ending 9/1/21 and the EPA's estimates of the 4.2kgs of carbon emissions saved per 1 kg of recycled plastic used. The EPA website provides information and metrics that states that the difference in total carbon created when creating and producing a KG of virgin PET compared to a KG of recycled PET (PCR) is 4.2kg more for the virgin material. Thus, for every 1kg of recycled PET material used, we create 4.2kg less carbon emissions than if we had used virgin PET material.", "price": {"value": "11..97", "currency": "$"}, "url": "https://www.amazon.com/Dial-Complete-Antibacterial-Foaming-Refill/dp/B00JPLMD00/ref=sr_1_148?qid=1684824147&s=beauty-intl-ship&sr=1-148"}