{"title": "Baby Wipes, Huggies Natural Care Sensitive Baby Diaper Wipes, Unscented, Hypoallergenic, 12 Flip-Top Packs (768 Wipes Total)", "asin": "B07SCL613T", "brand": "Kimberly-Clark Corp.", "stars": "4.8", "reviewsCount": "116,832 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/81P3ykZf4TL._AC_SX425_PIbundle-12,TopRight,0,0_SH20_.jpg", "breadCrumbs": ["Baby Products", "›", "Diapering", "›", "Wipes & Holders", "›", "Wipes & Refills"], "description": "Huggies Natural Care Sensitive Baby Wipes gives your baby an extra soft and gentle clean with every wipe. Made with 99% purified water and 1% skin essential ingredients, these baby wipes have reliably offered you plant-based ingredients for over 20 years. The unique base sheet is infused with aloe and vitamin E and keeps your baby's skin clean by locking in and absorbing the mess. To help maintain healthy skin for your baby, the Huggies Natural Care unscented disposable wipes are hypoallergenic, dermatologist-tested and pH-balanced. They're recognized by the National Eczema Association because they're fragrance free, alcohol free, paraben free and do not contain phenoxyethanol or MIT, making them safe for sensitive skin. Coming in adorable Winnie-the-Pooh-inspired packaging, each wipe is extra soft and gentle, making them ideal for sensitive newborn skin. Plus, with a flip-top design and EZ Pull 1-Handed Dispensing, you can easily grab wipes without wasting sheets. With the #1 branded wipe**, you can feel confident you are giving baby a safe, gentle clean every time. Join the Huggies Rewards Powered by Fetch to get rewarded fast. Earn points on Huggies diapers and wipes, in addition to thousands of other products to redeem for hundreds of gift cards. Check out the Fetch Rewards app to get started today! (*70%+ by weight) (**Based on US Nielsen data ending 9/4/2021)", "price": {"value": "22.86", "currency": "$"}, "url": "https://www.amazon.com/HUGGIES-Natural-Unscented-Sensitive-Water-Based/dp/B07SCL613T/ref=sr_1_2?qid=1684817433&s=baby-products-intl-ship&sr=1-2"}