{"title": "Sizzix 660200 Big Shot Manual Die, 6 Inches", "asin": "B00R50G1I8", "brand": "Ellison", "stars": "4.6", "reviewsCount": "4,938 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/41lFVEQH0+L._SX425_.jpg", "breadCrumbs": ["Arts, Crafts & Sewing", "›", "Scrapbooking & Stamping", "›", "Die-Cutting & Embossing", "›", "Die-Cuts"], "description": "Big Shot, 660200 Looking for the perfect die cutting machine for card making? Why not try our our extremely popular manual machine The Sizzix Big Shot machine is the perfect tool for a wide range of creative pursuits and caters for everyone from the beginner to the expert The A5 sized platform allows you to cut a variety of materials up to 6 inches wide and with just one roll through the Big Shot machine, you can create a detailed and precise design to suit your creative needs. Designed with the potential to cut materials ranging from tissue to cork, as well as fabric and wood, the project possibilities are endless Compatible with the full Sizzix library, including Sizzix Bigz, Thinlits, Framelits (excluding Plus and Pro dies) as well as Embossing Folders, you can create a never ending collection of high end die cutting products. What's included? 1 Big Shot Machine, 1 Platform, 1 Thin Die Adapter and 1 Pair of Standard Cutting Pads. What is die cutting? Die cutting is a quick and easy way of producing individual, or mass shapes from paper, foil, cardstock or even chipboard using a machine and die, instead of cutting by hand. What cuts my material? A die cutting machine will always be necessary in order to die cut, though it's not the machine itself that physically cuts your material. The die cutter you use (for example a Sizzix Bigz, Thinlits or Framelits die), is responsible for revealing your design. The machine just applies the pressure. So if you're ever unsure whether you can die cut a certain material, check the compatibility of your die rather than your machine.", "price": {"value": "92.98", "currency": "$"}, "url": "https://www.amazon.com/Sizzix-660200-Cutting-Embossing-Machine/dp/B00R50G1I8/ref=sr_1_793?qid=1684768913&s=arts-crafts-intl-ship&sr=1-793"}