{"title": "Graco TurboBooster Backless Booster Car Seat, Galaxy", "asin": "B007UYBOJU", "brand": "15 x 16 x 8.5 inches", "stars": "4.8", "reviewsCount": "28,941 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/91pRzZbuSqL._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Car Seats & Accessories", "›", "Car Seats", "›", "Booster"], "description": "Graco's top-rated Backless TurboBooster Car Seat helps keep your big kid safe in the car. This backless booster seat is built for comfort with a padded seat and height-adjustable armrests. It's a terrific option to help protect older children and kids who are ready to transition out of a harness booster, but not yet ready to ride with just your vehicle's seat belt. According to the American Academy of Pediatrics and the National Highway Traffic Safety Administration, school-aged children should ride in a belt-positioning booster seat until at least age 8 or until the seat belt fits correctly. The Backless TurboBooster car seat is designed to protect children ages 4 to 10 who are between 40 and 100 lbs and 43 to 57 inches tall. Dual, hideaway cup holders are just right for holding your child's cups or water bottles, so that they've got just what they need for a comfortable ride in the car with you. After all, a comfortable passenger is a happy passenger. When you're ready to clean your deluxe, padded seat cushion, simply remove it and wash it in your washing machine with gentle detergent. Then, all plastic parts of the seat may be cleaned with mild soap and water. The Backless TurboBooster seat has been engineered and rigorously crash tested to meet or exceed all applicable US standards. Product information/Technical Details Chart: Minimum height recommendation: 43 inches Maximum height recommendation: 57 inches.", "price": {"value": "20.29", "currency": "$"}, "url": "https://www.amazon.com/Graco-Backless-TurboBooster-Seat-Galaxy/dp/B007UYBOJU/ref=sr_1_6?qid=1684817433&s=baby-products-intl-ship&sr=1-6"}