{"title": "Lansinoh Stay Dry Disposable Nursing Pads, Soft and Super Absorbent Breast Pads, Breastfeeding Essentials for Moms, 200 Count", "asin": "B06XPHR7DF", "brand": "9.8 x 11.73 x 5.9 inches", "stars": "4.8", "reviewsCount": "47,486 ratings", "thumbnailImage": "https://m.media-amazon.com/images/I/71e0wNZ3ZQL._SY355_.jpg", "breadCrumbs": ["Baby Products", "›", "Feeding", "›", "Breastfeeding", "›", "Nursing Pads"], "description": "New moms shouldn’t have to worry about leaks! Lansinoh Disposable Nursing Pads are super absorbent for extra confidence. Trusted by parents around the world, Lansinoh nursing pads keep you dry and comfortable all day and at night. Our pads are individually wrapped for convenience on the go. A thin, contoured shape offers a discreet fit and two adhesive strips help the pads stay in place. Latex free. BPA and BPS free. These nursing pads are an FSC-certified product, made from material from well-managed FSC-certified forests and from recycled materials. For nearly 40 years, new mothers have trusted Lansinoh to support and care for them while they enter the messy magic of motherhood. Born from one mother’s realization that birthing people often go without the support they need and deserve, Lansinoh proudly stands with mothers all over the world. Our journey started with award winning, doctor recommended HPA Lanolin Nipple Cream: today, we offer a comprehensive collection of solutions to help new parents navigate pregnancy, birth, breastfeeding, and pumping. Our product range includes organic nipple balm, disposable nursing pads, washable nursing pads, breastmilk storage bags, manual breast pumps and double electric breast pumps, postpartum essentials, baby bottles, and more. Lansinoh products are available in more than 70 countries and the company is committed to being climate neutral by 2030.", "price": {"value": "19.71", "currency": "$"}, "url": "https://www.amazon.com/Lansinoh-Nursing-Packs-Disposable-Breast/dp/B06XPHR7DF/ref=sr_1_27?qid=1684817442&s=baby-products-intl-ship&sr=1-27"}